{
  "mml_classification": [
    {
      "mml-order": 1,
      "mml-name": "tarski",
      "title": "Tarski {G}rothendieck Set Theory",
      "summary": "This is the first part of the axiomatics of the Mizar system. It includes the axioms of the Tarski Grothendieck set theory. They are:  the axiom stating that everything is a set,  the extensionality axiom,  the definitional axiom of the singleton,  the definitional axiom of the pair,  the definitional axiom of the union of a family of sets,  the definitional axiom of the boolean (the power set) of a set,  the regularity axiom,  the definitional axiom of the ordered pair,  the Tarski's axiom~A introduced in \\cite{TARSKI:1} (see also \\cite{TARSKI:2}),  and the Fr\\ae nkel scheme. Also, the definition of equinumerosity is introduced.",
      "msc2020": "03E30",
      "msc2020(edu)": "97E60",
      "keywords": "set, axiom, TG set theory",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 2,
      "mml-name": "xboole_0",
      "title": "Boolean Properties of Sets --- Definitions",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, boolean operator",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 3,
      "mml-name": "boole",
      "title": "Boolean Properties of Sets --- Requirements",
      "summary": "This article contains proofs of the theorems which are    obvious if the directive 'requirements BOOLE;' will    be added to enviroment declaration of the Mizar article.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, boolean operator",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 4,
      "mml-name": "xboole_1",
      "title": "Boolean Properties of Sets --- Theorems",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, boolean operator",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 5,
      "mml-name": "enumset1",
      "title": "Enumerated Sets",
      "summary": "We prove basic facts about enumerated sets: definitional theorems and their immediate consequences, some theorems related to the decomposition of an enumerated set into union of two sets, facts about removing elements that occur more than once, and facts about permutations of enumerated sets (with the length $\\le$ 4). The article includes also schemes enabling instantiation of up to nine universal quantifiers.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, finite, enumerate",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 6,
      "mml-name": "xtuple_0",
      "title": "Kuratowski pairs. {T}uples and projections.",
      "summary": "The article substitutes some stuff that originally   was in MCART_1, RECDEF_1 and FUNCT_5 articles.   One concept, the 'pair' attribute was originally introduces in FACIRC_1.   Most of it had been generalized.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, pair",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 7,
      "mml-name": "xfamily",
      "title": "Families of Subsets",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, family of subsets",
      "directory": "/set/basic/scheme",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 8,
      "mml-name": "xregular",
      "title": "Consequences of Regularity Axiom",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, regularity",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 9,
      "mml-name": "zfmisc_1",
      "title": "Some Basic Properties of Sets",
      "summary": "In this article some basic theorems about singletons, pairs, power sets,  unions of families of sets, and the cartesian product of two sets are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, singleton, pair, power sets,  family of sets, Cartesian product",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 10,
      "mml-name": "subset_1",
      "title": "Properties of Subsets",
      "summary": "     The text includes theorems concerning properties   of subsets, and some operations on sets.   The functions yielding improper subsets of a set,   i.e. the empty set and the set itself are introduced.   Functions and predicates introduced for sets are   redefined.   Some theorems about enumerated sets are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, subset",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 11,
      "mml-name": "subset",
      "title": "Basic Properties of Subsets --- Requirements",
      "summary": "This file contains statements which are obvious for Mizar checker if  \"requirements SUBSET\" is included in the environment description  of an article. They are published for testing purposes only.  Users should use appropriate requirements instead of referencing  to these theorems.  Some of these items need also \"requirements BOOLE\" for proper work.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, subset",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 12,
      "mml-name": "setfam_1",
      "title": "Families of Sets",
      "summary": "      The article contains definitions of the following concepts: family of sets, family of subsets of a set, the intersection of a family of sets. Functors $\\cup$, $\\cap$, and $\\setminus$ are redefined for families of subsets of a set. Some properties of these notions are presented.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, family of sets",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 13,
      "mml-name": "relat_1",
      "title": "Relations and Their Basic Properties",
      "summary": "   We define here: mode Relation as a set of pairs, the domain, the codomain, and the field of relation; the empty and the identity relations, the composition of relations, the image and the inverse image of a set under a relation. Two predicates, = and $\\subseteq$, and three functions,  $\\cup$, $\\cap$ and $\\setminus$ are redefined. Basic facts about the above mentioned notions are presented.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, relation",
      "directory": "/set/relation",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 14,
      "mml-name": "funct_1",
      "title": "Functions and Their Basic Properties",
      "summary": "   The definitions of the mode Function and the graph of a function are introduced. The graph of a function is defined to be identical with the function. The following concepts are also defined: the domain of a function, the range of  a function, the identity function, the composition of functions, the 1-1 function, the inverse function, the restriction of  a function, the image and the inverse image. Certain basic facts about functions and the notions defined in the article are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 15,
      "mml-name": "grfunc_1",
      "title": "Graphs of Functions",
      "summary": "   The graph of a function is defined in \\cite{FUNCT_1.ABS}. In this paper the graph of a function is redefined as a Relation. Operations on functions are interpreted as the corresponding operations  on relations. Some theorems about graphs of functions are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 16,
      "mml-name": "relat_2",
      "title": "Properties of Binary Relations",
      "summary": "The paper contains definitions of some properties of binary relations: reflexivity, irreflexivity, symmetry, asymmetry, antisymmetry, connectedness, strong connectedness, and transitivity. Basic theorems relating the above mentioned notions are given.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, relation",
      "directory": "/set/relation",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 17,
      "mml-name": "ordinal1",
      "title": "The Ordinal Numbers",
      "summary": "In the beginning of the article we show some consequences of the regularity axiom. In the second part we introduce the successor of a set and the notions of transitivity and connectedness wrt membership relation. Then we define ordinal numbers as transitive and connected sets, and we prove some theorems of them and of their sets. Lastly we introduce the concept of a transfinite sequence and we show transfinite induction and schemes of defining by transfinite induction.",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "set, ordinal",
      "directory": "/set/ordinal",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 18,
      "mml-name": "wellord1",
      "title": "The Well Ordering Relations",
      "summary": "Some theorems about well ordering relations are proved. The goal of the article is to prove that every two well ordering relations are either isomorphic or one of them is isomorphic to a segment of the other. The following concepts are defined: the segment of a relation induced by an element, well founded relations, well ordering relations, the restriction of a relation to a set, and the isomorphism of two relations. A number of simple facts is presented.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, relation",
      "directory": "/set/relation",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 19,
      "mml-name": "relset_1",
      "title": "Relations Defined on Sets",
      "summary": "    The article includes theorems concerning properties of  relations defined as a subset of the Cartesian product of two sets  (mode Relation of $X$,$Y$ where $X$,$Y$ are sets). Some notions,  introduced in \\cite{RELAT_1.ABS}  such as domain, codomain, field of a relation,  composition of relations, image and inverse image of a set under a relation  are redefined.                ",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, relation, Cartesian product",
      "directory": "/set/relation",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 20,
      "mml-name": "partfun1",
      "title": "Partial Functions",
      "summary": "In the article we define partial functions. We also define the following notions related to partial functions and functions themselves: the empty function, the restriction of a function to a partial function from a set into a set, the set of all partial functions from a set into a set,  the total functions, the relation of tolerance of two functions and  the set of all total functions which are tolerated by a partial function. Some simple propositions related to the introduced notions are proved. In the beginning of this article we prove some auxiliary theorems  and schemes related to the articles: \\cite{FUNCT_1.ABS} and \\cite{FUNCT_2.ABS}.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function, partial function",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 21,
      "mml-name": "mcart_1",
      "title": "Tuples, Projections and {C}artesian Products",
      "summary": "The purpose of this article is to define projections of ordered pairs, and to introduce triples and quadruples, and their projections. The theorems in this paper may be roughly divided into two groups: theorems describing basic properties of introduced concepts and theorems related to the regularity, analogous to those proved for ordered pairs by Cz. Byli\\'nski \\cite{ZFMISC_1.ABS}. Cartesian products of subsets are redefined as subsets of Cartesian products.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, projection, Cartesian product, tuples",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 22,
      "mml-name": "wellord2",
      "title": "Zermelo Theorem and Axiom of Choice",
      "summary": "The article is continuation of \\cite{WELLORD1.ABS} and \\cite{ORDINAL1.ABS}, and the goal of it is show that Zermelo theorem (every set has a relation which well orders it - proposition (26)) and axiom of choice (for every non-empty family of non-empty and separate sets there is set which has exactly one common element with arbitrary family member - proposition (27)) are true. It is result of the Tarski's axiom A introduced in \\cite{TARSKI:1} and repeated in \\cite{TARSKI.ABS}. Inclusion as a settheoretical binary relation is introduced, the correspondence of well ordering relations to ordinal numbers is shown, and basic properties of equinumerosity are presented. Some facts are based on \\cite{KURAT-MOST:1}.",
      "msc2020": "03E25",
      "msc2020(edu)": "97E60",
      "keywords": "set, ordinal, Zermelo theorem, Axiom of choice, order",
      "directory": "/set/choice",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 23,
      "mml-name": "funct_2",
      "title": "Functions from a Set to a Set",
      "summary": "   The article is a continuation of \\cite{FUNCT_1.ABS}.    We define the following concepts:  a function from a set $X$ into a set $Y$, denoted by ``Function of $X$,$Y$'',  the set of all functions from a set $X$ into a set $Y$, denoted by Funcs($X$,$Y$),  and the permutation of a set (mode Permutation of $X$, where $X$ is a set). Theorems and schemes included in the article are reformulations of the theorems of \\cite{FUNCT_1.ABS} in the new terminology. Also some basic facts about functions of two variables are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function, permutation, function space",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 24,
      "mml-name": "binop_1",
      "title": "Binary Operations",
      "summary": "In this paper we define binary and unary operations on domains. We also define the following predicates concerning the operations:  $\\dots$ is commutative,  $\\dots$ is associative, $\\dots$ is the unity of $\\dots$, and $\\dots$ is distributive wrt $\\dots$. A number of schemes useful in justifying the existence of the operations are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function, binary operation",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 25,
      "mml-name": "domain_1",
      "title": "Domains and Their {C}artesian Products",
      "summary": "The article includes: theorems related to domains, theorems related to Cartesian products presented earlier in various articles and simplified here by substituting domains for sets and omitting the assumption that the sets involved must not be empty. Several schemes and theorems related to Fraenkel operator are given. We also redefine subset yielding functions such as the pair of elements of a set and the union of two subsets of a set.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, domain, Cartesian product",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 26,
      "mml-name": "funct_3",
      "title": "Basic Functions and Operations on Functions",
      "summary": "We define the following mappings: the characteristic function of a subset of a set, the inclusion function (injection or embedding), the projections from a Cartesian product onto its arguments and diagonal function (inclusion  of a set into its Cartesian square). Some operations  on functions are also defined: the products of two functions (the complex function and  the more general product-function), the function induced on power sets by the image and inverse-image. Some simple propositions  related to the introduced notions are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 27,
      "mml-name": "funcop_1",
      "title": "Binary Operations Applied to Functions",
      "summary": "In the article we introduce functors yielding to a binary operation its composition with an arbitrary functions on its left side, its right side or both. We prove theorems describing the basic properties of these functors. We introduce also constant functions and converse of a function. The recent concept is defined for an arbitrary function, however is meaningful in the case of functions which range is a subset of a Cartesian product of two sets. Then the converse of a function has the same domain as the function itself and assigns to an element of the domain the mirror image of the ordered pair assigned by the function. In the case of functions defined on a non-empty set we redefine the above mentioned functors and prove simplified versions of theorems proved in the general case. We prove also theorems stating relationships between introduced concepts and such properties of binary operations as commutativity or associativity.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 28,
      "mml-name": "realset1",
      "title": "Group and Field Definitions",
      "summary": "   The article contains exactly the same definitions of group and field as those in \\cite{DIEUDONNE}.   These definitions were prepared without the help of the definitions and properties of {\\it Nat} and {\\it Real} modes included in the MML.   This is the first of a series of articles in which we are going to introduce the concept of the set of real numbers in a elementary axiomatic way.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, numeral",
      "directory": "/set/numeral",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 29,
      "mml-name": "funct_4",
      "title": "The Modification of a Function by a Function and the Iteration of the Composition of a Function",
      "summary": "In the article we introduce some operations on functions. We define the natural ordering relation on functions. The fact that  a function $f$ is less than a function $g$ we denote by $f \\leq g$ and we define by $\\hbox{graph} f \\subseteq \\hbox{graph} f$. In the sequel we define the modifications of a function $f$ by a function $g$ denoted $f \\hbox{+$\\cdot$} g$ and the $n$-th iteration of the composition of  a function $f$ denoted by $f^n$. We prove some propositions related to the introduced notions.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 30,
      "mml-name": "numerals",
      "title": "Numerals --- Requirements",
      "summary": "This file contains statements which are obvious for Mizar checker if  \"requirements NUMERALS\" is included in the environment description  of an article. They are published for testing purposes only.  Users should use appropriate requirements instead of referencing  to these theorems.  Some of these items need also other requirements for proper work.  Statements which cannot be expressed in Mizar language are commented out.",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "set, numeral",
      "directory": "/set/numeral",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 31,
      "mml-name": "ordinal2",
      "title": "Sequences of Ordinal Numbers",
      "summary": "  In the first part of the article we introduce the following operations: On $X$ that yields the set of all ordinals which belong to the set $X$, Lim $X$ that yields the set of all limit ordinals which belong to $X$, and inf $X$ and sup $X$ that yield the minimal ordinal belonging to $X$ and the minimal ordinal greater than all ordinals belonging to $X$, respectively.   The second part of the article starts with schemes that can be used to justify the correctness of definitions based on the transfinite induction (see \\cite{ORDINAL1.ABS} or \\cite{KURAT-MOST:1}). The schemes are used to define addition, product and power of ordinal numbers. The operations of limes inferior and limes superior of sequences of ordinals are defined and the concepts of limit of ordinal sequence and increasing and continuous sequence are introduced.",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "set, ordinal",
      "directory": "/set/ordinal",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 32,
      "mml-name": "ordinal3",
      "title": "Ordinal Arithmetics",
      "summary": "At the beginning the article contains some auxiliary theorems concerning the constructors defined in papers \\cite{ORDINAL1.ABS} and \\cite{ORDINAL2.ABS}. Next simple properties of addition and multiplication of ordinals are shown, e.g. associativity of addition. Addition and multiplication of a transfinite sequence of ordinals and a ordinal are also introduced here. The goal of the article is the proof that the distributivity of multiplication wrt addition and the associativity of multiplication hold. Additionally new binary functors of ordinals are introduced: subtraction, exact division, and remainder and some of their basic properties are presented.",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "set, ordinal, sup, inf, limit",
      "directory": "/set/ordinal",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 33,
      "mml-name": "wellset1",
      "title": "Zermelo's Theorem",
      "summary": "   The article contains direct proof of Zermelo's theorem about the existence of a well ordering for any set and the lemma the proof depends on.",
      "msc2020": "03E25",
      "msc2020(edu)": "97E60",
      "keywords": "set, Zermelo theorem, Axiom of choice",
      "directory": "/set/choice",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 34,
      "mml-name": "multop_1",
      "title": "Three-Argument Operations and Four-Argument Operations",
      "summary": "    The article contains the definition of three- and four- argument operations. The article introduces also a few operation related schemes:  {\\it FuncEx3D}, {\\it TriOpEx}, {\\it Lambda3D}, {\\it TriOpLambda}, {\\it FuncEx4D},  {\\it QuaOpEx}, {\\it Lambda4D}, {\\it QuaOpLambda}.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 35,
      "mml-name": "schems_1",
      "title": "Schemes",
      "summary": "  Some basic schemes of quantifier calculus are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, scheme",
      "directory": "/set/basic/scheme",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 36,
      "mml-name": "sysrel",
      "title": "Some Properties of Binary Relations",
      "summary": "The article contains some theorems on binary relations, which are used in papers \\cite{FF_SIEC.ABS}, \\cite{E_SIEC.ABS}, \\cite{S_SIEC.ABS}, and other.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, binary relation, Cartesian product",
      "directory": "/set/relation",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 37,
      "mml-name": "finset_1",
      "title": "Finite Sets",
      "summary": "   The article contains the definition of a finite set based on the notion of finite sequence. Some theorems about properties of finite sets and finite families of sets are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, finite set",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 38,
      "mml-name": "card_1",
      "title": "Cardinal Numbers",
      "summary": "We present the choice function rule in the beginning of the article. In the main part of the article we formalize the base of cardinal theory. In the first section we introduce the concept of cardinal numbers and order relations between them. We present here Cantor-Bernstein theorem and other properties of order relation of cardinals. In the second section we show that every set has cardinal number equipotence to it. We introduce notion of alephs and we deal with the concept of finite set. At the end of the article we show two schemes of cardinal induction. Some definitions are based on \\cite{GUZ-ZBIER:1} and \\cite{KURAT-MOST:1}.",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "set, cardinal, order relation, Cantor-Bernstein theorem, finite set",
      "directory": "/set/cardinal",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 39,
      "mml-name": "classes1",
      "title": "Tarski's Classes and Ranks",
      "summary": "In the article the Tarski's classes (non-empty families of sets satisfying Tarski's axiom A given in \\cite{TARSKI.ABS}) and the rank sets are introduced and some of their properties are shown. The transitive closure and the rank of a set is given here too.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, class, Tarski class, rank",
      "directory": "/set/class",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 40,
      "mml-name": "pboole",
      "title": "Many-sorted Sets",
      "summary": "The article deals with parameterized families of sets. When treated in a similar way as sets (due to systematic overloading notation used for sets) they are called many sorted sets. For instance, if $x$ and $X$ are two many-sorted sets (with the same set of indices $I$) then relation  $x \\in X$ is defined as $\\forall_{i \\in I} x_i \\in X_i$.\\par I was prompted by a remark in a paper by Tarlecki and Wirsing:  ``Throughout the paper we deal with many-sorted sets, functions, relations etc. ... We feel free to use any standard set-theoretic notation without explicit use of indices''  \\cite[p.~97]{Tar-Wir1}. The aim of this work was to check the feasibility of such approach in Mizar. It works.\\par Let us observe some peculiarities:  \\begin{itemize}  \\item[-]   empty set (i.e. the many sorted set with empty set of indices) belongs    to itself (theorem 133),  \\item[-]   we get two different inclusions   $X \\subseteq Y$ iff $\\forall_{i \\in I} X_i \\subseteq Y_i$ and   $X \\sqsubseteq Y$ iff $\\forall_x x \\in X \\Rightarrow x \\in Y$ equivalent only for sets that yield non empty values.  \\end{itemize} Therefore the care is advised.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, family of set, many sorted set",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 41,
      "mml-name": "gate_1",
      "title": "Logic Gates and Logical Equivalence of Adders",
      "summary": "This is an experimental article which shows that logical correctness of logic circuits can be easily proven by the Mizar system. First, we define the notion of logic gates.   Then we prove that an MSB carry of `4 Bit Carry Skip Adder' is equivalent to an MSB carry of a normal 4 bit adder.   In the last theorem, we show that outputs of the `4 Bit Carry Look Ahead Adder' are equivalent to the corresponding outputs of the normal 4 bits adder.    The policy here is as follows: when the functional (semantic) correctness of a system is already proven, and the correspondence of the system to a (normal) logic circuit is given, it is enough to prove the correctness of  the new circuit if we only prove the logical equivalence between them.   Although the article is very fundamental (it contains few environment files), it can be applied to real problems.    The key of the method introduced here is to put the specification of the logic circuit into the Mizar propositional formulae, and to use the strong inference ability of the Mizar checker.  The proof is done formally so that the automation of the proof writing is possible. Even in the 5.3.07 version of Mizar, it can handle a formulae of more than 100 lines, and a formula which contains more than 100 variables.    This means that the Mizar system is enough to prove logical correctness of middle scaled logic circuits.",
      "msc2020": "03G05 & 94C11 & 94D10",
      "msc2020(edu)": "97P10",
      "keywords": "logic, circuit, logic gate",
      "directory": "/coumputer/circuit",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 42,
      "mml-name": "gate_2",
      "title": "Correctness of Binary Counter Circuits",
      "summary": "This article introduces the verification of the correctness for the operations and the specification of the 3-bit counter. Both cases: without reset input and with reset input are considered. The proof was proposed by Y. Nakamura in \\cite{GATE_1.ABS}.",
      "msc2020": "03G05 & 94C11 & 94D10",
      "msc2020(edu)": "97P10",
      "keywords": "logic, circuit, logic gate",
      "directory": "/coumputer/circuit",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 43,
      "mml-name": "gate_3",
      "title": "Correctness of {J}ohnson Counter Circuits",
      "summary": "This article introduces the verification of the correctness for the operations and the specification of the Johnson counter. We formalize the concepts of 2-bit, 3-bit and 4-bit Johnson counter circuits with a reset input, and define the specification of the state transitions without the minor loop.",
      "msc2020": "03G05 & 94C11 & 94D10",
      "msc2020(edu)": "97P10",
      "keywords": "logic, circuit, logic gate",
      "directory": "/coumputer/circuit",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 44,
      "mml-name": "gate_4",
      "title": "Correctness of a Cyclic Redundancy Check Code Generator",
      "summary": "We prove the correctness of the division circuit and the CRC (cyclic redundancy    checks) circuit by verifying the contents of the register after one shift.    Circuits with 12-bit register and 16-bit register are taken as examples.    All the proofs are done formally.",
      "msc2020": "03G05 & 94C11 & 94D10",
      "msc2020(edu)": "97P10",
      "keywords": "logic, circuit, logic gate",
      "directory": "/coumputer/circuit",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 45,
      "mml-name": "gate_5",
      "title": "The Correctness of the High Speed Array Multiplier Circuits",
      "summary": "This article introduces the verification of the correctness for the operations and the specification of the high speed array multiplier. We formalize the concepts of 2-by-2 and 3-by-3 bit Plain array multiplier, 3-by-3 Wallace tree multiplier circuit, and show that outputs of the array multiplier are equivalent to outputs of normal (sequencial) multiplier.",
      "msc2020": "03G05 & 94C11 & 94D10",
      "msc2020(edu)": "97P10",
      "keywords": "logic, circuit, logic gate",
      "directory": "/coumputer/circuit",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 46,
      "mml-name": "finsub_1",
      "title": "Boolean Domains",
      "summary": "BOOLE DOMAIN is a SET DOMAIN that is closed under union and difference. This condition is equivalent to being closed under symmetric difference and one of the following operations: union, intersection or difference. We introduce the set of all finite subsets of a set $A$, denoted by Fin $A$. The mode Finite Subset of a set $A$ is introduced with the mother type:  Element of Fin $A$. In consequence,  ``Finite Subset of \\dots '' is an elementary type, therefore one may use such types as ``set of Finite Subset of $A$'', ``[(Finite Subset of $A$), Finite Subset of $A$]'', and so on. The article begins with some auxiliary theorems that belong really to \\cite{BOOLE.ABS} or \\cite{ORDINAL1.ABS} but are missing there. Moreover, bool $A$ is redefined as a SET DOMAIN, for an arbitrary set $A$.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, boolean domain, power set",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 47,
      "mml-name": "orders_1",
      "title": "Partially Ordered Sets",
      "summary": "In the beginning of this article we define the choice function of a non-empty set family that does not contain $\\emptyset$ as introduced in  \\cite[pages 88--89]{KURAT:1}.     We define order of a set as a relation being reflexive, antisymmetric and transitive in the set,  partially ordered set as structure non-empty set and order of the set, chains, lower and upper cone of a subset, initial segments of element and subset of partially ordered set.   Some theorems that belong rather to \\cite{ZFMISC_1.ABS}  or \\cite{RELAT_2.ABS} are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, ordered set, choice function",
      "directory": "/set/basic",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 48,
      "mml-name": "setwiseo",
      "title": "Semilattice Operations on Finite Subsets",
      "summary": "In the article we deal with a binary operation that is associative, commutative. We define for such an operation a functor that depends on two more arguments: a finite set of indices and a function indexing elements of the domain of the operation and yields the result of applying the operation to all indexed elements. The definition has a restriction that requires that either the set of indices is non empty or the operation has the unity. We prove theorems describing some properties of the functor introduced. Most of them we prove in two versions depending on which requirement is fulfilled. In the second part we deal with the union of finite sets that enjoys mentioned above properties. We prove analogs of the theorems proved in the first part. We precede the main part of the article with auxiliary theorems related to boolean properties of sets, enumerated sets, finite subsets, and functions. We define a casting function that yields to a set the empty set typed as a finite subset of the set. We prove also two schemes of the induction on finite sets.",
      "msc2020": "03G10 & 06B05",
      "msc2020(edu)": "97H50",
      "keywords": "set, semilattice, binary operation, finite subset",
      "directory": "/set/semilattice",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 49,
      "mml-name": "fraenkel",
      "title": "Function Domains and {F}r{\\ae}nkel Operator",
      "summary": "We deal with a non--empty set of functions and a non--empty set of functions from a set $A$ to a non--empty set $B$. In the case when $B$ is a non--empty set, $B^A$ is redefined. It yields a non--empty set of functions from $A$ to $B$. An element of such a set is redefined as a function from $A$ to $B$. Some theorems concerning these concepts are proved, as well as a number  of schemes dealing with infinity and the Axiom of Choice. The article contains a number of schemes allowing for simple logical transformations related to terms constructed with the Fr{\\ae}nkel Operator.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, Frankel operator, Frankel domain, axiom of choice",
      "directory": "/set/basic/scheme",
      "note": "may should be moved to /set/choice",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 50,
      "mml-name": "funct_5",
      "title": "Curried and Uncurried Functions",
      "summary": "In the article following functors are introduced: the projections of subsets of the Cartesian product, the functor which for every function  $f:X \\times Y \\to Z$ gives some curried function ($X \\to(Y \\to Z)$), and the functor which from curried functions makes uncurried functions. Some of their properties and some properties of the set of all functions from a set into a set are also shown.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function, projection, Cartesian product, curry function",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 51,
      "mml-name": "partfun2",
      "title": "Partial Functions from a Domain to a Domain",
      "summary": "The value of a partial function from a domain to a domain and a inverse partial function are introduced. The value and inverse function were defined in the article \\cite{FUNCT_1.ABS}, but new definitions are introduced.  The basic properties of the value, the inverse partial function, the identity partial function, the composition of partial functions, the $1{-}1$ partial function, the restriction of a partial function, the image, the inverse image and the graph are proved. Constant partial functions are introduced, too.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function, partial function, inverse function",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 52,
      "mml-name": "card_3",
      "title": "K\\\"onig's Theorem",
      "summary": "In the article the sum and product of any number of cardinals are introduced and their relationships to addition, multiplication and to other concepts are shown. Then the K\\\"onig's theorem is proved. The theorem that the cardinal of union of increasing family of sets  of power less than some cardinal {\\bf m} is not greater than {\\bf m}, is given too.",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "set, cardinal",
      "directory": "/set/cardinal",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 53,
      "mml-name": "funct_6",
      "title": "Cartesian Product of Functions",
      "summary": " A supplement of \\cite{CARD_3.ABS} and \\cite{FUNCT_5.ABS},     i.e. some useful and explanatory properties of the product and also     the curried and uncurried functions are shown. Besides, the functions yielding     functions are considered: two different products and other operation of      such functions are     introduced. Finally, two facts are presented: quasi-distributivity of     the power of the set to other one w.r.t. the union     ($X^{\\biguplus_{x}f(x)} \\approx \\prod_{x}X^{f(x)}$) and     quasi-distributivity of the product w.r.t. the raising to the power     ($\\prod_{x}{f(x)^X} \\approx (\\prod_{x}f(x))^X$).",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, function, Cartesian product",
      "directory": "/set/function",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 54,
      "mml-name": "arytm_3",
      "title": "Arithmetic of Non-Negative Rational Numbers",
      "msc2020": "11A99",
      "msc2020(edu)": "97F40",
      "keywords": "non-negative rational number, arithmetic, construction",
      "directory": "/number/rational",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 55,
      "mml-name": "arytm_2",
      "title": "Non-Negative Real Numbers. {P}art {I}",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number, arithmetic, construction, Dedekind cut",
      "directory": "/number/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 56,
      "mml-name": "arytm_1",
      "title": "Non-Negative Real Numbers. {P}art {II}",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number, arithmetic, construction",
      "directory": "/number/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 57,
      "mml-name": "numbers",
      "title": "Subsets of Complex Numbers",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "complex number, arithmetic, construction",
      "directory": "/number/complex",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 58,
      "mml-name": "arytm_0",
      "title": "Introduction to Arithmetics",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number, arithmetic",
      "directory": "/number/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 59,
      "mml-name": "xcmplx_0",
      "title": "Complex Numbers --- Basic Definitions",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "complex number, arithmetic",
      "directory": "/number/complex",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 60,
      "mml-name": "arithm",
      "title": "Field Properties of Complex Numbers --- Requirements",
      "summary": "This file contains statements which are obvious for Mizar checker if  \"requirements ARITHM\" is included in the environment description  of an article.  They are published for testing purposes only.  Users should use appropriate requirements instead of referencing  to these theorems.  Some of these items need also other requirements for proper work.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "complex number, field property",
      "directory": "/number/complex",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 61,
      "mml-name": "xxreal_0",
      "title": "Introduction to Arithmetic of Extended Real Numbers",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number, arithmetic, min, max",
      "directory": "/number/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 62,
      "mml-name": "xreal_0",
      "title": "Introduction to Arithmetic of Real Numbers",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number, arithmetic",
      "directory": "/number/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 63,
      "mml-name": "real",
      "title": "Basic Properties of Real Numbers --- Requirements",
      "summary": "This file contains statements which are obvious for Mizar checker if  \"requirements REAL\" is included in the environment description  of an article. \"requirements NUMERALS\" is also required.  They are published for testing purposes only.  Users should use appropriate requirements instead of referencing  to these theorems.  Statements which cannot be expressed in Mizar language are commented out.  Some of these items need also other requirements for proper work.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number",
      "directory": "/number/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 64,
      "mml-name": "xcmplx_1",
      "title": "Complex Numbers --- Basic Theorems",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "complex number, arithmetic",
      "directory": "/number/complex",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 65,
      "mml-name": "xreal_1",
      "title": "Real Numbers -- Basic Theorems",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number, arithmetic",
      "directory": "/number/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 66,
      "mml-name": "axioms",
      "title": "Strong Arithmetic of Real Numbers",
      "summary": "This abstract contains the second part of the axiomatics of the Mizar system (the first part is in abstract \\cite{TARSKI.ABS}). The axioms listed here characterize the Mizar built-in concepts that are automatically attached to every Mizar article. We give definitional axioms of the following concepts: element, subset, Cartesian product, domain (non empty subset), subdomain (non empty subset of a domain), set domain (domain consisting of sets). Axioms of strong arithmetics of real numbers are also included.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number, axioms, arithmetic",
      "directory": "/number/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 67,
      "mml-name": "real_1",
      "title": "Basic Properties of Real Numbers",
      "summary": "Basic facts of arithmetics of real numbers are presented: definitions and properties of the complement element, the inverse element, subtraction and division; some basic properties of the set REAL (e.g. density), and the scheme of separation for sets of reals.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number, arithmetic",
      "directory": "/number/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 68,
      "mml-name": "square_1",
      "title": "Some Properties of Real Numbers Operations: min, max, square, and square root",
      "summary": "We define the following operations on real numbers:   $max(x,y)$, $min(x,y)$, $x^2$, $\\sqrt{x}$. We prove basic properties of introduced operations. A number of auxiliary theorems absent in \\cite{REAL_1.ABS} and   \\cite{ABSVALUE.ABS} is proved.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number, complex number, square, square root",
      "directory": "/number/operator",
      "note": "may should be moved to /algebra/number",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 69,
      "mml-name": "nat_1",
      "title": "The Fundamental Properties of Natural Numbers",
      "summary": "Some fundamental properties of addition, multiplication, order relations, exact division, the remainder, divisibility, the least common multiple, the greatest common divisor are presented. A proof of Euclid algorithm is also given.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F30",
      "keywords": "natural number, arithmetic, least common multiple, greatest common divisor",
      "directory": "/number/natural",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 70,
      "mml-name": "int_1",
      "title": "Integers",
      "summary": "In the article the following concepts were introduced:  the set of integers (${\\Bbb Z }$)  and its elements (integers),  congruences ($i_1 \\equiv i_2 (\\mathop{\\rm mod} i_3)$),  the ceiling and floor functors ($\\mathopen{\\lceil} x \\mathclose{\\rceil}$ and  $\\mathopen{\\lfloor} x \\mathclose{\\rfloor}$), also  the fraction part of a real number (frac),  the integer division ($\\div$) and remainder of integer division (mod). The following schemes were also included:  the separation scheme ({\\it SepInt}),  the schemes of integer induction ({\\it Int\\_Ind\\_Down},  {\\it Int\\_Ind\\_Up}, {\\it Int\\_Ind\\_Full}),  the minimum ({\\it Int\\_Min}) and maximum ({\\it Int\\_Max}) schemes (the   existence of minimum and maximum integers enjoying a given property).",
      "msc2020": "11A99",
      "msc2020(edu)": "97F40",
      "keywords": "integer, arithmetic, floor, ceil, mod, div",
      "directory": "/number/integer",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 71,
      "mml-name": "rat_1",
      "title": "Basic Properties of Rational Numbers",
      "summary": "A definition of rational numbers and some basic properties of them. Operations of addition, subtraction, multiplication are redefined for rational numbers. Functors numerator (num $p$) and denominator (den $p$) ($p$ is rational) are defined and some properties of them are presented. Density of rational numbers is also given.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F40",
      "keywords": "rational number, arithmetic, numerator, denominator",
      "directory": "/number/rational",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 72,
      "mml-name": "membered",
      "title": "On the Sets Inhabited by Numbers",
      "summary": "The information that all members of a set enjoy a property expressed  by an adjective can be processed in a systematic way. The purpose  of the work is to find out how to do that. If it works, `membered'  will become a reserved word and the work with it will be automated.  I have chosen {\\it membered} rather than {\\it inhabited} because of  the compatibility with the Automath terminology.  The phrase $\\tau$ {\\it inhabits}  $\\theta$ could be translated to $\\tau$ {\\bfseries\\itshape is}  $\\theta$ in Mizar.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F99",
      "keywords": "number, member, belong",
      "directory": "/number/common",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 73,
      "mml-name": "valued_0",
      "title": "Number-valued Functions",
      "msc2020": "11A99",
      "msc2020(edu)": "97I20",
      "keywords": "number, function, number-valued",
      "directory": "/number/function",
      "note": "may should be moved to /function/number",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 74,
      "mml-name": "complex1",
      "title": "The Complex Numbers",
      "summary": "We define the set $\\Bbb C$ of complex numbers as the set of all ordered pairs  $z =\\langle a,b\\rangle$ where $a$ and $b$ are real numbers and where addition and multiplication are defined. We define the real and imaginary parts of $z$ and denote this by $a = \\Re(z)$, $b = \\Im(z)$. These definitions satisfy all the axioms for a field.   $0_{\\Bbb C} = 0+0i$ and $1_{\\Bbb C} = 1+0i$ are identities  for addition and multiplication respectively, and there are multiplicative  inverses for each non zero element in $\\Bbb C$. The difference and division of complex numbers are also defined. We do not interpret the set of all real numbers $\\Bbb R$ as a subset of  $\\Bbb C$. From here on we do not abandon the ordered pair notation for  complex numbers. For example: $i^2 = (0+1i)^2 = -1+0i \\neq -1$. We conclude this article by introducing two operations on $\\Bbb C$ which are not field operations.  We define the absolute value of $z$ denoted by $|z|$ and the conjugate of $z$ denoted by $z^\\ast$.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "complex nubmer, real part, imaginary part",
      "directory": "/number/complex",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 75,
      "mml-name": "absvalue",
      "title": "Some Properties of Functions Modul and Signum",
      "summary": "The article includes definitions and theorems concerning basic properties of the following functions: $|x|$ -- modul of real number, sgn $x$ -- signum of real number.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "real number, abs, signum function",
      "directory": "/number/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 76,
      "mml-name": "int_2",
      "title": "The Divisibility of Integers and Integer Relatively Primes   ",
      "summary": "     We introduce the following notions:        1) the least common multiple of two integers          ($\\mathop{\\rm lcm}(i,j)$),        2) the greatest common divisor of two integers          ($\\mathop{\\rm gcd}(i,j)$),        3) the relative prime integer numbers,        4) the prime numbers.      A few facts concerning the      above items, among them a so-called Fundamental Theorem      of Arithmetic, are introduced.",
      "msc2020": "11A05 & 11A41 & 11A51",
      "msc2020(edu)": "97F40",
      "keywords": "integer, prime, division, coprime, gcd, lcm, least common multiple, greatest common divisor",
      "directory": "/number/integer",
      "note": "may should be moved to /number/prime, or /number/divisibility",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 77,
      "mml-name": "nat_d",
      "title": "Divisibility of Natural Numbers",
      "summary": "This file contains basic facts concerning divisibility   of natural numbers, mainly copied from \\cite{NAT_1.ABS}.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F30",
      "keywords": "natural number, div, mod, division, gcd, lcm, least common multiple, greatest common divisor",
      "directory": "/number/natural",
      "note": "may should be moved to /number/divisibility",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 78,
      "mml-name": "binop_2",
      "title": "Binary Operations on Numbers",
      "msc2020": "11A99",
      "msc2020(edu)": "97I20",
      "keywords": "number, binary operation",
      "directory": "/number/function",
      "note": "may should be moved to /function/number",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 79,
      "mml-name": "xxreal_1",
      "title": "Basic Properties of Extended Real Numbers",
      "summary": "The file contains basic result about extended real numbers,     and is devoted mainly to the arithmetics of (real) intervals in     more general setting.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "extended real number, interval",
      "directory": "/number/extreal",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 80,
      "mml-name": "card_2",
      "title": "Cardinal Arithmetics",
      "summary": "In the article addition, multiplication and power operation of cardinals are  introduced.  Presented are some  properties  of equipotence of Cartesian products, basic cardinal  arithmetics  laws (transformativity, associativity,  distributivity),  and  some facts about finite sets.",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "set, cardinal, multiplication, power set",
      "directory": "/set/cardinal",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 81,
      "mml-name": "xxreal_2",
      "title": "Suprema and Infima of Intervals of Extended Real Numbers",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "extended real number, interval, sup, inf, upper bound, lower bound",
      "directory": "/number/extreal",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 82,
      "mml-name": "xxreal_3",
      "title": "Basic Operations on Extended Real Numbers",
      "msc2020": "11A99",
      "msc2020(edu)": "97F50",
      "keywords": "extended real number, arithmetic",
      "directory": "/number/extreal",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 83,
      "mml-name": "member_1",
      "title": "Collective Operations on Number-Membered Sets",
      "summary": "The article starts with definitions of sets of opposite and    inverse numbers of a given number membered set. Next, collective addition,   subtraction, multiplication and division of two sets are defined.    Complex numbers cases and extended real numbers ones are introduced    separately and unified for reals. Shortcuts for singletons cases are also defined.",
      "msc2020": "11A99",
      "msc2020(edu)": "97F99",
      "keywords": "number, function, number-valued",
      "directory": "/number/function",
      "note": "may should be moved to /function/number",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 84,
      "mml-name": "supinf_1",
      "title": "Infimum and Supremum of the Set of Real Numbers. {M}easure Theory",
      "summary": "We introduce some properties of the least upper bound and the greatest lower bound of the subdomain of $\\overline{\\Bbb R}$ numbers, where $\\overline{\\Bbb R}$ denotes the enlarged set of real numbers, $\\overline{\\Bbb R} = {\\Bbb R} \\cup \\{-\\infty,+\\infty\\}$. The paper contains definitions of majorant and minorant elements, bounded from above, bounded from below and bounded sets,  sup  and  inf  of set, for nonempty subset of $\\overline{\\Bbb R}$. We prove theorems describing the basic relationships among those definitions. The work is the first part of the series of articles concerning the Lebesgue measure theory.",
      "msc2020": "28A12",
      "msc2020(edu)": "97I50",
      "keywords": "extented real number, sup, inf, measurement",
      "directory": "/analysis/measure/real",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 85,
      "mml-name": "quin_1",
      "title": "Quadratic Inequalities",
      "summary": "       Consider a quadratic trinomial of the form $P(x)=ax^2+bx+c$, where $a\\ne 0$.  The determinant of the equation $P(x)=0$ is of the form  $\\Delta(a,b,c)=b^2-4ac$. We prove several quadratic inequalities when $\\Delta(a,b,c)<0$, $\\Delta(a,b,c)=0$ and $\\Delta(a,b,c)>0$.",
      "msc2020": "12D10",
      "msc2020(edu)": "97H30",
      "keywords": "quadratic equation, discriminant, solvability, inequality",
      "directory": "/algebra/equation/real",
      "note": "should be moved to other directory?",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 86,
      "mml-name": "classes2",
      "title": "Universal Classes",
      "summary": "In the article we have shown that there exist universal classes, i.e. there are sets which are closed w.r.t. basic set theory operations.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, class, universal class",
      "directory": "/set/class",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 87,
      "mml-name": "ordinal4",
      "title": "Increasing and Continuous Ordinal Sequences",
      "summary": "Concatenation of two ordinal sequences, the mode of all ordinals belonging to a universe and the mode of sequences of them with length equal to the rank of  the universe are introduced. Besides, the increasing and continuous transfinite sequences, the limes of ordinal sequences and the power of ordinals, and the fact that every increasing and continuous transfinite sequence has critical numbers (fixed points) are discussed.",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "set, ordinal, ordinal sequence",
      "directory": "/set/ordinal",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 88,
      "mml-name": "finseq_1",
      "title": "Segments of Natural Numbers and Finite Sequences",
      "summary": "We define the notion of an initial segment of natural numbers and prove a number of their properties. Using this notion we introduce finite sequences, subsequences, the empty sequence, a sequence of a domain, and the operation of concatenation of two sequences.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "structure, finite sequence",
      "directory": "/sequence/finite",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 89,
      "mml-name": "recdef_1",
      "title": "Recursive Definitions",
      "summary": "  The text contains some schemes which allow elimination of definitions by recursion.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "set, structure, finite sequence, scheme, recursive definition",
      "directory": "/sequence/finite/scheme",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 90,
      "mml-name": "eqrel_1",
      "title": "Equivalence Relations and Classes of Abstraction",
      "summary": "In this article we deal with the notion of equivalence relation. The main properties of equivalence relations are proved. Then we define the classes of abstraction determined by an equivalence relation. Finally, the connections between a partition of a set and an equivalence relation are presented. We introduce the following notation of modes: {\\it Equivalence Relation, a partition}.",
      "msc2020": "03E02",
      "msc2020(edu)": "97E60",
      "keywords": "set, equivalent relation, equivalence class",
      "directory": "/set/relation",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 91,
      "mml-name": "finseq_2",
      "title": "Finite Sequences and Tuples of Elements of a Non-empty Sets",
      "summary": "The first part of the article is a continuation of \\cite{FINSEQ_1.ABS}. Next, we define the identity sequence of natural numbers and the constant sequences. The main part of this article is the definition of tuples. The element of a set of all sequences of the length $n$ of $D$ is called a tuple of a non-empty set $D$ and it is denoted by element of $D^{n}$. Also some basic facts about tuples of a non-empty set are proved.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "structure, finite sequence, constant sequence, tuple",
      "directory": "/sequence/finite",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 92,
      "mml-name": "finseqop",
      "title": "Binary Operations Applied to Finite Sequences",
      "summary": "The article contains some propositions and theorems related to   \\cite{FUNCOP_1.ABS} and \\cite{FINSEQ_2.ABS}. The notions introduced in \\cite{FUNCOP_1.ABS} are extended to finite sequences. A number of additional propositions related to this notions are proved. There are also proved some properties of distributive operations and unary  operations. The notation and propositions for inverses are introduced.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "structure, finite sequence, binary operation",
      "directory": "/sequence/finite",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 93,
      "mml-name": "finseq_3",
      "title": "Non-contiguous Substrings and One-to-one Finite Sequences",
      "summary": "This text is a continuation of \\cite{FINSEQ_1.ABS}. We prove a number of theorems concerning both notions introduced there and one-to-one finite sequences. We introduce a function that removes from a string elements of the string that belongs to a given set.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "structure, finite sequence, operation",
      "directory": "/sequence/finite",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 94,
      "mml-name": "valued_1",
      "title": "Properties of Number-valued Functions",
      "msc2020": "11A99",
      "msc2020(edu)": "97I20",
      "keywords": "number, function, number-valued",
      "directory": "/number/function",
      "note": "may should be moved to /function/number",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 95,
      "mml-name": "seq_1",
      "title": "Real Sequences and Basic Operations on Them",
      "summary": " Definition of real sequence and operations on sequences (multiplication of sequences and multiplication by a real number, addition, subtraction, division and absolute value of sequence) are given.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "sequence, real number, operation",
      "directory": "/sequence/infinite",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 96,
      "mml-name": "comseq_1",
      "title": "Complex Sequences",
      "summary": "Definitions of complex sequence and operations on sequences (multiplication of sequences and multiplication by a complex number, addition, subtraction, division and absolute value of sequence) are given. We followed \\cite{SEQ_1.ABS}.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "sequence, complex number, operation",
      "directory": "/sequence/infinite",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 97,
      "mml-name": "xboolean",
      "title": "On the Arithmetic of Boolean Values",
      "summary": "In this EMM item various formulas of boolean arithmetic     are collected. Main part is gathered from articles originally     authored by Shunichi Kobayashi (series {\\tt BVFUNC} and     {\\tt BINARI}).",
      "msc2020": "03G05 & 06E05",
      "msc2020(edu)": "97H20",
      "keywords": "boolean, operation",
      "directory": "/algebra/boolean",
      "note": "may should be moved to other place like /number/boolean",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 98,
      "mml-name": "comseq_2",
      "title": "Conjugate Sequences, Bounded Complex Sequences and    Convergent Complex Sequences",
      "summary": "This article is a continuation of \\cite{COMSEQ_1.ABS}. It is divided into five sections. The first one contains a few useful lemmas. In the second part there is a definition of conjugate sequences and proofs of some basic properties of such sequences. The third segment treats of bounded complex sequences,next one contains description of convergent complex sequences. The last and the biggest part of the article contains proofs of main theorems concerning the theory of bounded and convergent complex sequences.",
      "msc2020": "40A05",
      "msc2020(edu)": "97I30",
      "keywords": "sequence, complex number, convergence, boundary, limit",
      "directory": "/sequence/convergence",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 99,
      "mml-name": "seq_2",
      "title": "Convergent Sequences and the Limit of Sequences",
      "summary": " The article contains definitions and same basic properties of bounded sequences (above and below), convergent sequences and the limit of sequences.  In the article there are some properties of real numbers useful in the other theorems of this article.",
      "msc2020": "40A05",
      "msc2020(edu)": "97I30",
      "keywords": "sequence, convergence, boundary, limit",
      "directory": "/sequence/convergence",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 100,
      "mml-name": "margrel1",
      "title": "Many-Argument Relations",
      "summary": "Definitions of relations based on finite sequences. The arity of relation, the set of logical values {\\it Boolean} consisting of   {\\it false} and {\\it true} and the operations of negation and conjunction  on them are defined.  ",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, many argument relation",
      "directory": "/set/relation",
      "note": "may should be moved to /set/ma-relation",
      "期限": "2021-10-21T15:00:00.000Z"
    },
    {
      "mml-order": 101,
      "mml-name": "toler_1",
      "title": "Relations of Tolerance",
      "summary": "  Introduces notions of relations of tolerance, tolerance set and neighbourhood of an element. The basic properties of relations of tolerance are proved.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, tolerance relation, tolerance space",
      "directory": "/set/relation",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 102,
      "mml-name": "trees_1",
      "title": "Introduction to Trees",
      "summary": "The article consists of two parts: the first one deals with the concept of the prefixes of a finite sequence, the second one introduces and deals with the concept of tree. Besides some auxiliary propositions concerning finite sequences are presented. The trees are introduced as non-empty sets of finite sequences of natural numbers which are closed on prefixes and on sequences of less numbers (i.e. if $\\langle n_1$, $n_2$, $\\dots$,  $n_k\\rangle$ is a vertex (element) of a tree and $m_i \\leq n_i$ for $i = 1$, $2$, $\\dots$, $k$, then $\\langle m_1$, $m_2$, $\\dots$,  $m_k\\rangle$ also is). Finite trees, elementary trees with $n$ leaves, the leaves and the subtrees of a tree, the inserting of a tree into another tree, with a node used for determining the place of insertion, antichains of prefixes, and height and width of finite trees are introduced.",
      "msc2020": "05C05 & 68P05",
      "msc2020(edu)": "97N70 & 97P20 & 97K30",
      "keywords": "tree structure",
      "directory": "/graph/tree",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 103,
      "mml-name": "finseq_4",
      "title": "Pigeon Hole Principle",
      "summary": "We introduce the notion of a predicate that states that a function is one-to-one at a given element of its domain (i.e. counterimage of image of the element is equal to its singleton). We also introduce some rather technical functors concerning finite sequences: the lowest index of the given element of the range of the finite sequence, the substring preceding (and succeeding) the first occurrence of given element of the range. At the end of the article we prove the pigeon hole principle.",
      "msc2020": "40-00 & 68R01",
      "msc2020(edu)": "97I30 & 97N70",
      "keywords": "pigeonhole principle, finte sequence",
      "directory": "/sequence/finite",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 104,
      "mml-name": "finsop_1",
      "title": "Binary Operations on Finite Sequences",
      "summary": "We generalize the semigroup operation on finite sequences introduced in \\cite{SETWOP_2.ABS} for binary operations that have a unity or for non-empty finite sequences.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "structure, finite sequence, binary operation",
      "directory": "/sequence/finite",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 105,
      "mml-name": "setwop_2",
      "title": "Semigroup Operations on Finite Subsets",
      "summary": "A continuation of \\cite{SETWISEO.ABS}. The propositions and theorems proved in \\cite{SETWISEO.ABS} are extended to finite sequences. Several additional theorems related to semigroup operations of functions not included in \\cite{SETWISEO.ABS} are proved. The special notation for operations on finite sequences is introduced. ",
      "msc2020": "03E20 & 20M10",
      "msc2020(edu)": "97H40",
      "keywords": "set, finte sets, semigroup operation",
      "directory": "/set/basic",
      "note": "may should be moved to /set/operation",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 106,
      "mml-name": "rfunct_1",
      "title": "Partial Functions from a Domain to the Set of Real Numbers",
      "summary": "Basic operations in the set of partial functions which map a domain to the set of all real numbers are introduced. They include adition, subtraction, multiplication, division, multipication by a real number and also module.  Main properties of these operations are proved. A definition of the partial function bounded on a set (bounded below and bounded above) is presented.  There are theorems showing the laws of conservation of totality and boundedness for operations of partial functions. The characteristic function of a subset of a domain as a partial function is redefined and a few properties are proved.",
      "msc2020": "26A03 & 03E20",
      "msc2020(edu)": "97I20",
      "keywords": "number, function, number-valued, operation, real-valued",
      "directory": "/analysis/basic/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 107,
      "mml-name": "rvsum_1",
      "title": "The Sum and Product of Finite Sequences of Real Numbers",
      "summary": "Some operations on the set of $n$-tuples of real numbers are introduced. Addition, difference of such $n$-tuples, complement of a $n$-tuple and multiplication of these by real numbers are defined. In these definitions more general properties of binary operations applied to finite sequences  from \\cite{FINSEQOP.ABS} are used. Then the fact that certain  properties are satisfied by those operations is demonstrated directly from \\cite{FINSEQOP.ABS}. Moreover some properties can be recognized as being those of real vector space. Multiplication of $n$-tuples of real numbers and  square power of $n$-tuple of real numbers  using for notation of some properties of finite sums and products of real  numbers are defined, followed by definitions of  the finite sum and product of $n$-tuples of real numbers using notions and properties introduced in \\cite{SETWOP_2.ABS}. A number of propositions and theorems on sum and product of finite sequences  of real numbers are proved. As additional properties there are proved some properties of real numbers  and set representations of binary operations on real numbers.",
      "msc2020": "11B13 & 40-00",
      "msc2020(edu)": "97I30",
      "keywords": "structure, finite sequence, sum, product, real nubmer, complex number",
      "directory": "/sequence/finite",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 108,
      "mml-name": "newton",
      "title": "Factorial and {N}ewton Coefficients",
      "summary": "We define the following functions: exponential function (for natural exponent), factorial function and Newton coefficients. We prove some basic properties of notions introduced. There is also a proof of binominal formula. We prove also that $\\sum_{k=0}^n {n \\choose k}=2^n$.",
      "msc2020": "05A10 & 11B65",
      "msc2020(edu)": "97F30 & 97K20",
      "keywords": "exponential function, factorial, binomial coefficient, Newton coefficient, natural number",
      "directory": "/number/combinatorics",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 109,
      "mml-name": "card_4",
      "title": "Countable Sets and {H}essenberg's Theorem",
      "summary": " The concept of countable sets is introduced and there are shown some facts which deal with finite and countable sets. Besides, the article includes theorems and lemmas on the sum and product of infinite cardinals. The most important of them is Hessenberg's theorem which says that for every infinite cardinal {\\bf m} the product ${\\bf m} \\cdot {\\bf m}$ is equal to {\\bf m}.",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "countable set, Hessenberg's Theorem, infinite cardinal, sum, product, ",
      "directory": "/set/cardinal",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 110,
      "mml-name": "card_5",
      "title": "On Powers of Cardinals",
      "summary": "In the first section the results of \\cite[axiom (30)]{AXIOMS.ABS}\\footnote  {Axiom (30)\\quad ---\\quad $n = \\{k\\in{\\Bbb N}: k < n\\}$  for every natural number $n$.}, i.e. the correspondence between natural and ordinal (cardinal) numbers are shown. The next section is concerned with the concepts of infinity and cofinality (see \\cite{ZFREFLE1.ABS}), and introduces alephs as infinite cardinal numbers. The arithmetics of alephs, i.e. some facts about addition and multiplication, is present in the third section. The concepts of regular and irregular alephs are introduced in the fourth section, and the fact that $\\aleph_0$ and every non-limit cardinal number are regular is proved there. Finally, for every alephs $\\alpha$ and $\\beta$  $$\\alpha^\\beta = \\left\\{  \\begin{array}{ll}    2^\\beta,& {\\rm if}\\ \\alpha\\leq\\beta,\\\\    \\sum_{\\gamma<\\alpha}\\gamma^\\beta,&       {\\rm if}\\ \\beta < {\\rm cf}\\alpha\\ {\\rm and}        \\ \\alpha\\ {\\rm is\\ limit\\ cardinal},\\\\    \\left(\\sum_{\\gamma<\\alpha}\\gamma^\\beta\\right)^{\\rm cf\\alpha},&       {\\rm if\\ cf}\\alpha \\leq \\beta \\leq \\alpha.\\\\  \\end{array}\\right.$$  \\\\ Some proofs are based on \\cite{GUZ-ZBIER:1}.}",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "ordinal, power set, aleph, regular and irregular alephs, ",
      "directory": "/set/cardinal",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 111,
      "mml-name": "trees_2",
      "title": "K\\\"onig's {L}emma",
      "summary": "A continuation of \\cite{TREES_1.ABS}.     The notion of finite--order trees, succesors of an element of a tree,     and chains, levels and branches of a tree are introduced.     That notion has been used to formalize K\\\"onig's Lemma which claims that     there is a infinite branch of a finite-order tree if the tree has arbitrary     long finite chains.     Besides, the concept of decorated trees is introduced and     some concepts dealing with trees are applied to decorated trees.",
      "msc2020": "68R10 & 05C05 & 05C07 & 05C38 & 05C40",
      "msc2020(edu)": "97K30",
      "keywords": "Konig's lemma, tree, infinite graph, finite order, succesors, chain, levels, branch",
      "directory": "/graph/tree",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 112,
      "mml-name": "valued_2",
      "title": "Arithmetic Operations on Functions from Sets into Functional Sets",
      "summary": "In this paper we introduce sets containing number-valued functions.   Different arithmetic operations on maps between any set and such    functional sets are later defined.",
      "msc2020": "11A99",
      "msc2020(edu)": "97I20",
      "keywords": "number, function, number-valued",
      "directory": "/number/function",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 113,
      "mml-name": "seqm_3",
      "title": "Monotone Real Sequences. {S}ubsequences",
      "summary": " The article contains definitions of constant, increasing, decreasing, non decreasing, non increasing sequences, the definition of a subsequence and their basic properties.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "monotone sequence, increasing, decreasing, non increasing, non decreasing, subsequence, real number",
      "directory": "/sequence/infinite",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 114,
      "mml-name": "rfinseq",
      "title": "Functions and Finite Sequences of Real Numbers",
      "summary": "We define notions of fiberwise equipotent functions, non-increasing finite sequences of real numbers and new operations on finite sequences. Equivalent conditions for fiberwise equivalent functions and basic facts about new constructions are shown.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "fiberwise equipotent, non-increasing finite sequence, real number",
      "directory": "/sequence/finite/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 115,
      "mml-name": "seq_4",
      "title": "Convergent Real Sequences. {U}pper and Lower Bound of Sets of Real Numbers",
      "summary": " The article contains theorems about convergent sequences and the limit of sequences occurring in \\cite{SEQ_2.ABS} such as Bolzano-Weierstrass theorem, Cauchy theorem and others. Bounded sets of real numbers and lower and upper bound of subset of real numbers are defined.",
      "msc2020": "40A05",
      "msc2020(edu)": "97I30",
      "keywords": "convergent sequences, Bolzano-Weierstrass theorem, Cauchy theorem, bounded sets, lower bound, upper bound, real nubmer",
      "directory": "/sequence/convergence",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 116,
      "mml-name": "rcomp_1",
      "title": "Topological Properties of Subsets in Real Numbers",
      "summary": "The following notions for real subsets are defined: open set, closed set, compact set, intervals and neighbourhoods. In the sequel some theorems involving above mentioned notions are proved.",
      "msc2020": "26A03",
      "msc2020(edu)": "97I20",
      "keywords": "real number, topology, open set, closed set, interval, neighbourhood",
      "directory": "/analysis/continuity/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 117,
      "mml-name": "rfunct_2",
      "title": "Properties of Real Functions",
      "summary": "The list of theorems concerning properties of real sequences and functions is enlarged. (See e.g. \\cite{SEQ_1.ABS}, \\cite{SEQ_4.ABS},  \\cite{RFUNCT_1.ABS}). The monotone real functions are introduced and their properties are discussed.",
      "msc2020": "26A48",
      "msc2020(edu)": "97I20",
      "keywords": "monotone real functions, real-valued, increasing, decreasing, non increasing, non decreasing",
      "directory": "/analysis/basic/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 118,
      "mml-name": "cfunct_1",
      "title": "Property of Complex Functions",
      "summary": "This article introduces properties of complex function, calculations of them, boundedness and constant.",
      "msc2020": "30-00",
      "msc2020(edu)": "97I80",
      "keywords": "complex function, boundedness, constant",
      "directory": "/analysis/basic/complex",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 119,
      "mml-name": "fcont_1",
      "title": "Real Function Continuity",
      "summary": "The continuity of real functions is discussed. There is a function defined on some domain in real numbers which is continuous in a single point and on a subset of domain of the function. Main properties of real continuous functions are proved. Among them there is the Weierstra{\\ss} Theorem. Algebraic features for real continuous functions are shown. Lipschitzian functions are introduced. The Lipschitz condition entails continuity.",
      "msc2020": "26A15",
      "msc2020(edu)": "97I20",
      "keywords": "real function, continuity, Weierstrass Theorem, Lipschitzian functions, Lipschitz continuity",
      "directory": "/analysis/continuity/real",
      "note": "may should be moved to /analysis/real/function",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 120,
      "mml-name": "fcont_2",
      "title": "Real Function Uniform Continuity",
      "summary": "The uniform continuity for real functions is introduced. More theorems concerning continuous functions are given. (See \\cite{FCONT_1.ABS}) The Darboux Theorem is exposed. Algebraic features for uniformly continuous functions are presented. Various facts, e.g., a continuous function on a compact set is uniformly continuous are proved.",
      "msc2020": "26A15",
      "msc2020(edu)": "97I20",
      "keywords": "real function, uniform continuity, Darboux Theorem, compact set",
      "directory": "/analysis/continuity/real",
      "note": "may should be moved to /analysis/real/function",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 121,
      "mml-name": "fdiff_1",
      "title": "Real Function Differentiability",
      "summary": "For a real valued function defined on its domain in real numbers the differentiability in a single point and on a subset of the domain is presented. The main elements of differential calculus are developed. The algebraic properties of differential real functions are shown.",
      "msc2020": "26A24",
      "msc2020(edu)": "97I40",
      "keywords": "real function, differentiability",
      "directory": "/analysis/differential/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 122,
      "mml-name": "rolle",
      "title": "Average Value Theorems for Real Functions of One Variable",
      "summary": "Three basic theorems in differential calculus of one variable functions are presented: Rolle Theorem, Lagrange Theorem and Cauchy Theorem. There are also direct conclusions.",
      "msc2020": "26A24",
      "msc2020(edu)": "97I40",
      "keywords": "real function, differentiability, Rolle Theorem, Lagrange Theorem, Cauchy Theorem, Average Value Theorems",
      "directory": "/analysis/differential/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 123,
      "mml-name": "prepower",
      "title": "Integer and Rational Exponents",
      "summary": "The article includes definitios and theorems which are needed to define real exponent. The following notions are defined: natural exponent, integer exponent and rational exponent.",
      "msc2020": "33B10 & 26A09",
      "msc2020(edu)": "97F50",
      "keywords": "exponential function, natural exponent, integer exponent, rational exponent",
      "directory": "/analysis/real/exponent",
      "note": "may should be moved to /analysis/basic/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 124,
      "mml-name": "finseq_5",
      "title": "Some Properties of Restrictions of Finite Sequences",
      "summary": "The aim of the paper is to define some basic notions of     restrictions of finite sequences.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "structure, finite sequence, restriction",
      "directory": "/sequence/finite",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 125,
      "mml-name": "rewrite1",
      "title": "Reduction Relations",
      "summary": "The goal of the article is to start the formalization of Knuth-Bendix completion method (see \\cite{BachmairDershowitz},      \\cite{KlopMiddeldorp} or \\cite{HofLinCS};      see also \\cite{KnuthBendix},\\cite{Huet81}), i.e. to formalize the concept of the completion of a reduction relation. The completion of a reduction relation $R$ is a complete reduction relation equivalent to $R$ such that convertible elements have the same normal forms. The theory formalized in the article includes concepts and facts concerning normal forms, terminating reductions, Church-Rosser property, and equivalence of reduction relations.",
      "msc2020": "03B22 & 68Q60 & 68V15 & 68W30",
      "msc2020(edu)": "97E30",
      "keywords": "Knuth-Bendix completion method, reduction relation, completion, normal forms, terminating reductions, Church-Rosser property, equivalence of reduction relations",
      "directory": "/logic/rewrite",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 126,
      "mml-name": "funct_7",
      "title": "Miscellaneous Facts about Functions",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "function, finite sequence",
      "directory": "/set/function",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 127,
      "mml-name": "scheme1",
      "title": "Schemes of Existence of Some Types of Functions",
      "summary": "    We prove some useful schemes of  existence of real sequences, partial functions from  a domain into a domain, partial functions from a set  to a set and functions from a domain into a domain.  At the beginning we prove some related auxiliary  theorems related to the article \\cite{NAT_1.ABS}.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "function, scheme",
      "directory": "/set/function/scheme",
      "note": "may should be moved to /set/basic/scheme",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 128,
      "mml-name": "abian",
      "title": "{A}bian's Fixed Point Theorem",
      "summary": "A. Abian \\cite{abi68} proved the following theorem:  \\begin{quotation} Let $f$ be a mapping from a finite set $D$. Then $f$ has a fixed point if and only if $D$ is not a union of three mutually disjoint sets $A$,  $B$ and $C$ such that  \\[ A \\cap f[A] = B \\cap f[B] = C \\cap f[C] = \\emptyset.\\]  \\end{quotation} (The range of $f$ is not necessarily the subset of its domain). The proof of the sufficiency is by induction on the number of elements of $D$. A.~M\\c{a}kowski and K.~Wi{\\'s}niewski \\cite{maw69} have shown that the assumption of finiteness is superfluous. They proved their version of the theorem for $f$ being a function from $D$ into $D$. In the proof, the required partition was constructed and the construction used the axiom of choice. Their main point was to demonstrate that the use of this axiom in the proof is essential. We have proved in Mizar the generalized version of Abian's theorem, i.e. without assuming finiteness of $D$. We have simplified the proof from \\cite{maw69} which uses well-ordering principle and transfinite ordinals---our proof does not use these notions but otherwise is based on their idea (we employ choice functions).",
      "msc2020": "03E25",
      "msc2020(edu)": "97E60",
      "keywords": "Abian's fixed point theorem, Axiom of Choice, well-ordering principle",
      "directory": "/set/choice",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 129,
      "mml-name": "power",
      "title": "Real Exponents and Logarithms",
      "summary": "Definitions and properties of the following concepts: root, real exponent and logarithm. Also the number $e$ is defined.",
      "msc2020": "33B10 & 26A09",
      "msc2020(edu)": "97F50",
      "keywords": "root, real exponent, logarithm, Euler's number, Napier's constant",
      "directory": "/analysis/real/exponent",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 130,
      "mml-name": "polyeq_1",
      "title": "Solving Roots of Polynomial Equations of Degree 2 and 3 with Real Coefficients",
      "summary": "In this paper, we describe the definition of the first, second, and third degree algebraic equations and their properties. In Section 1, we defined the simple first-degree and second-degree (quadratic)  equation and discussed the relation between the roots of each equation and their coefficients. Also, we clarified the form of the root within the range of real numbers. Furthermore, the extraction of the root using the discriminant of equation is clarified. In Section 2, we defined the third-degree (cubic) equation and clarified the relation between the three roots of this equation and its coefficient. Also, the form of these roots for various conditions is discussed. This solution is known as the Cardano solution.",
      "msc2020": "12D10",
      "msc2020(edu)": "97H30",
      "keywords": "polynomial, algebraic equation, discriminant, quadratic  equation, cubic equation, solving roots, Cardano solution, real coefficient",
      "directory": "/algebra/equation",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 131,
      "mml-name": "series_1",
      "title": "Series",
      "summary": "The article contains definitions and properties of convergent serieses.",
      "msc2020": "40A05",
      "msc2020(edu)": "97I30",
      "keywords": "series, convergence, real series",
      "directory": "/sequence/convergence/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 132,
      "mml-name": "comseq_3",
      "title": "Convergence and the Limit of Complex Sequences. {S}eries",
      "msc2020": "40A05",
      "msc2020(edu)": "97I30",
      "keywords": "series, convergence, complex series",
      "directory": "/sequence/convergence/complex",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 133,
      "mml-name": "cfcont_1",
      "title": "Property of Complex Sequence and Continuity of Complex Function",
      "summary": "This article introduces properties of complex sequence and continuity of complex function. The first section shows convergence of complex sequence and constant complex sequence. In the next section, definition of continuity of complex function and properties of continuous complex function are shown.",
      "msc2020": "30B40",
      "msc2020(edu)": "97I80",
      "keywords": "series, convergence, complex series, continuity, complex function",
      "directory": "/analysis/continuity/complex",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 134,
      "mml-name": "cfdiff_1",
      "title": "Complex Function Differentiability",
      "summary": "For a complex valued function defined on its domain    in complex numbers the differentiability in a    single point and on a subset of the domain is presented.    The main elements of differential calculus are developed.    The algebraic properties of differential complex functions are shown.",
      "msc2020": "30A99",
      "msc2020(edu)": "97I80",
      "keywords": " complex sequence, complex function, continuity, differentiability",
      "directory": "/analysis/differential/complex",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 135,
      "mml-name": "rpr_1",
      "title": "Introduction to Probability",
      "summary": "Definitions of Elementary Event and Event in any sample space $E$ are given. Next, the probability of an Event when $E$ is finite is introduced and some properties of this function are investigated. Last part of the paper is devoted to the conditional probability and  essential properties of this function (Bayes Theorem).",
      "msc2020": "60A05 & 60A10",
      "msc2020(edu)": "97K50",
      "keywords": "probability, Bayes Theorem",
      "directory": "/probability/basic",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 136,
      "mml-name": "supinf_2",
      "title": "Series of Positive Real Numbers. {M}easure Theory",
      "summary": "     We introduce properties of a series of nonnegative  $\\overline{\\Bbb R}$  numbers, where  $\\overline{\\Bbb R}$ denotes   the enlarged set of real numbers,  $\\overline{\\Bbb R} = {\\Bbb R} \\cup \\{-\\infty,+\\infty\\}$.      The paper contains definition of  sup $F$ and inf $F$, for $F$ being function, and a definition of a sumable subset of $\\overline{\\Bbb R}$. We proved the basic theorems regarding the definitions mentioned above. The work is the second part of a series of articles concerning the Lebesgue measure theory.",
      "msc2020": "28A12",
      "msc2020(edu)": "97I50",
      "keywords": "Lesbegue measure, sup, inf, nonnegative real series",
      "directory": "/analysis/measure/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 137,
      "mml-name": "trees_a",
      "title": "Replacement of Subtrees in a Tree",
      "summary": " This paper is based on previous works \\cite{TREES_1.ABS},  \\cite{TREES_2.ABS} in which the operation replacement of subtree in a tree  has been defined. We extend this notion for arbitrary non empty antichain. ",
      "msc2020": "05C05 & 68P05",
      "msc2020(edu)": "97N70 & 97P20 & 97K30",
      "keywords": "tree, subtree, replacement, antichain",
      "directory": "/graph/tree",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 138,
      "mml-name": "pre_ff",
      "title": "Two Programs for {\\bf {SCM}}. {P}art {I} - Preliminaries",
      "summary": "In two articles (this one and \\cite{FIB_FUSC.ABS}) we discuss correctness of two short programs for the {\\bf SCM} machine: one computes Fibonacci numbers and the other computes the {\\em fusc} function of Dijkstra \\cite{DIJKSTRA}. The limitations of current Mizar implementation rendered it impossible to present the correctness proofs for the programs in one article. This part is purely technical and contains a number of very specific lemmas about integer division, floor, exponentiation and logarithms. The formal definitions of the Fibonacci sequence and the {\\em fusc} function may be of general interest.",
      "msc2020": "90C10 & 68Q60",
      "msc2020(edu)": "97N60",
      "keywords": "SCM machine, Fibonacci numbers, Dijkstra, fusc",
      "directory": "/computer/program/integer",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 139,
      "mml-name": "trees_3",
      "title": "Sets and Functions of Trees and Joining Operations of Trees",
      "summary": "In the article we deal with sets of trees and functions yielding trees. So, we introduce the sets of all trees, all finite trees and of all trees decorated by elements from some set. Next, the functions and the finite sequences yielding (finite, decorated) trees are introduced. There are shown some convenient but technical lemmas and clusters concerning with those concepts. In the fourth section we deal with trees decorated by Cartesian product and we introduce the concept of a tree called a substitution of structure of some finite tree. Finally, we introduce the operations of joining trees, i.e. for the finite sequence of trees we define the tree which is made by joining the trees from the sequence by common root. For one and two trees there are introduced the same operations.",
      "msc2020": "05C05 & 68P05",
      "msc2020(edu)": "97N70 & 97P20 & 97K30",
      "keywords": "set of tree, tree generator, decorated tree, Cartesian product, substitution",
      "directory": "/graph/tree",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 140,
      "mml-name": "partit1",
      "title": "A Theory of Partitions. {P}art {I}",
      "summary": "In this paper, we define join and meet operations between  partitions. The properties of these operations are proved.  Then we introduce the correspondence  between partitions and equivalence relations which preserve  join and meet operations.  The properties of these relationships are proved.",
      "msc2020": "03E02",
      "msc2020(edu)": "97E60",
      "keywords": "set partition, join, meet, equivalence relation",
      "directory": "/set/partition",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 141,
      "mml-name": "trees_4",
      "title": "Joining of Decorated Trees",
      "summary": "This is the continuation of the sequence of articles on trees (see \\cite{TREES_1.ABS}, \\cite{TREES_2.ABS}, \\cite{TREES_3.ABS}). The main goal is to introduce joining operations on decorated trees corresponding with operations introduced in \\cite{TREES_3.ABS}. We will also introduce the operation of substitution. In the last section we dealt with trees decorated by Cartesian product, i.e. we showed some lemmas on joining operations applied to such trees.",
      "msc2020": "05C05 & 68P05",
      "msc2020(edu)": "97N70 & 97P20 & 97K30",
      "keywords": "tree structure, decorated tree, Cartesian product, join",
      "directory": "/graph/tree",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 142,
      "mml-name": "card_fil",
      "title": "Basic Facts about Inaccessible and Measurable Cardinals",
      "summary": "Inaccessible, strongly inaccessible and measurable cardinals   are defined,   and it is proved that a measurable cardinal is strongly inaccessible. Filters   on sets are defined, some facts related to the section about cardinals   are proved. Existence of the Ulam matrix on non-limit cardinals is proved.",
      "msc2020": "03E10",
      "msc2020(edu)": "97E60",
      "keywords": "cardinal, inaccessible, strongly inaccessible, measurable cardinal, filter",
      "directory": "/set/cardinal",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 143,
      "mml-name": "binarith",
      "title": "Binary Arithmetics",
      "summary": "Formalizes the basic concepts of binary arithmetic and its related operations.  We present the definitions for the following logical operators: 'or' and 'xor' (exclusive or) and include in this article some theorems concerning these operators.   We also introduce the concept of an $n$-bit register.  Such registers are used in the definition of binary unsigned arithmetic presented in this article. Theorems on the relationships of such concepts to the operations of natural numbers are also given.",
      "msc2020": "11A63",
      "msc2020(edu)": "97F20",
      "keywords": "binary arithmetic, or, xor, register",
      "directory": "/number/binary",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 144,
      "mml-name": "pre_circ",
      "title": "Preliminaries to Circuits, {I}",
      "summary": "    This article is the first in a series of four articles (continued     in \\cite{MSAFREE2.ABS},\\cite{CIRCUIT1.ABS},\\cite{CIRCUIT2.ABS})     about modelling circuits by many-sorted algebras.\\par     Here, we introduce some auxiliary notations and prove auxiliary     facts about many sorted sets, many sorted functions and trees.",
      "msc2020": "68Q06 & 94C30",
      "msc2020(edu)": "97M10 & 97P30",
      "keywords": "circuit modelling, many sorted set",
      "directory": "/computer/circuit",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 145,
      "mml-name": "finseq_6",
      "title": "On the Decomposition of Finite Sequences",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "structure, finite sequence, decomposition, rotate",
      "directory": "/sequence/finite",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 146,
      "mml-name": "mboolean",
      "title": "Definitions and Basic Properties of Boolean and Union of Many Sorted Sets",
      "summary": "In the first part of this article I have proved theorems about   boolean of many sorted sets which are corresponded to theorems about   boolean of sets, whereas the second part of this article contains   propositions about union of many sorted sets. Boolean as well as union   of many sorted sets are defined as boolean and union on every sorts.",
      "msc2020": "03G05 & 06E05",
      "msc2020(edu)": "97H20",
      "keywords": "boolean, many sorted set, union",
      "directory": "/algebra/boolean",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 147,
      "mml-name": "wsierp_1",
      "title": "The {C}hinese {R}emainder {T}heorem",
      "summary": "The article is a translation of the first chapters of a book {\\em Wst{\\Ple}p  do teorii liczb} (Eng. {\\em Introduction to Number Theory}) by W. Sierpi\\'nski, WSiP, Biblioteczka Matematyczna, Warszawa, 1987. The first few pages of this book  have already been formalized in MML. We prove the Chinese Remainder Theorem and Thue's Theorem as well as several useful number theory propositions.",
      "msc2020": "11A07",
      "msc2020(edu)": "97F40",
      "keywords": "residue, Chinese remainder theorem, congruence",
      "directory": "/algebra/integer",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 148,
      "mml-name": "glib_000",
      "title": "Alternative Graph Structures",
      "summary": "We define the notion of a graph anew without using the available     Mizar structures.  In our approach, we model graph structure as     a finite function whose domain is a subset of natural numbers.     The elements of the domain of the function play the role of     selectors for accessing the components of the structure.  As these     selectors are first class objects, many future extensions of the new     graph structure turned out to be easier to formalize in Mizar than     with the traditional Mizar structures.     \\par     After introducing graph structure, we define its selectors and     then conditions that the structure needs to satisfy to form a      directed graph (in the spirit of \\cite{GRAPH_1.ABS}).       For these graphs we define a collection of basic graph notions;     the presentation of these notions is continued in      articles \\cite{GLIB_001.ABS,GLIB_002.ABS,GLIB_003.ABS}.     \\par     We have tried to follow a number of graph theory books in choosing     graph terminology but since the terminology is not commonly agreed upon,     we had to make a number of compromises, see \\cite{gl04}.",
      "msc2020": "05C07 & 05C62 & 68R10",
      "msc2020(edu)": "97K30",
      "keywords": "graph, cardinal, order, finite, loopless, subgraph, simple, degree, ",
      "directory": "/graph/basic",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 149,
      "mml-name": "pzfmisc1",
      "title": "Some Basic Properties of Many Sorted Sets",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, family of set, many sorted set",
      "directory": "/set/basic",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 150,
      "mml-name": "genealg1",
      "title": "Basic Properties of Genetic Algorithm",
      "summary": "We defined the set of the gene, the space treated by the genetic  algorithm and the individual of the space. Moreover, we defined some genetic operators such as one point crossover and two points crossover, and the validity  of many characters were proven.",
      "msc2020": "68W50 & 17D92",
      "msc2020(edu)": "97P80",
      "keywords": "genetic algorithm, genetic operator, crossover",
      "directory": "/computer/algorithm",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 151,
      "mml-name": "binari_2",
      "title": "Binary Arithmetics, Addition and Subtraction of Integers",
      "summary": "This article is a continuation of \\cite{BINARITH.ABS} and presents the concepts of binary arithmetic operations for integers. There is introduced 2's complement representation of integers and natural numbers to integers are expanded.   The binary addition and subtraction for integers are defined and theorems on the relationship between binary and numerical operations presented.",
      "msc2020": "11A63",
      "msc2020(edu)": "97F20",
      "keywords": "binary arithmetic, two's complement, integer, addition, subtraction",
      "directory": "/number/binary",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 152,
      "mml-name": "trees_9",
      "title": "Subtrees",
      "summary": "The concepts of root tree, the set of successors of a node in decorated tree and sets of subtrees are introduced.",
      "msc2020": "05C05 & 68P05",
      "msc2020(edu)": "97N70 & 97P20 & 97K30",
      "keywords": "tree, subtree, successor",
      "directory": "/graph/tree",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 153,
      "mml-name": "mssubfam",
      "title": "Certain Facts about Families of Subsets of Many Sorted Sets",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, many sorted set, family of subsets",
      "directory": "/set/basic",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 154,
      "mml-name": "relset_2",
      "title": "Properties of First and Second Order Cutting of Binary Relations",
      "summary": "This paper introduces some notions concerning binary relations according to \\cite{Riguet}. It is also an attempt to complement the knowledge contained in Mizar Mathematical Library regarding binary relations. We define here an image and inverse image of element of set A under binary relation of two sets A,B as image and  inverse image of singleton of the element under this relation, respectively.  Next, we define \"The First Order Cutting Relation of two sets A,B under a subset of the set A\"  as the union of images of elements of this subset under the relation. We also define \"The Second Order Cutting Subset of the Cartesian Product of two sets A,B under a subset of the set A\" as an intersection of images of elements of this subset under the subset of the cartesian product. The paper also defines first and second projection of binary relations. The main goal of the article is to prove properties and collocations of introduced definitions in this paper. The numbers written in parenthesis after the label of theorems correspond to the numbers of expressions contained in  the original article.",
      "msc2020": "03E20",
      "msc2020(edu)": "97E60",
      "keywords": "set, relation",
      "directory": "/set/relation",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 155,
      "mml-name": "recdef_2",
      "title": "Recursive Definitions. {P}art {II}",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "set, structure, scheme, recursive definition",
      "directory": "/set/basic/scheme",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 156,
      "mml-name": "prob_1",
      "title": " $\\sigma$-Fields and Probability",
      "summary": "This article contains definitions and theorems concerning basic properties of following objects: - a field of subsets of given nonempty set; - a sequence of subsets of given nonempty set; - a $\\sigma$-field of subsets of given nonempty set and events from this $\\sigma$-field; - a probability i.e. $\\sigma$-additive normed measure defined on previously   introduced $\\sigma$-field; - a $\\sigma$-field generated by family of subsets of given set; - family of Borel Sets.",
      "msc2020": "60A10 & 28A05",
      "msc2020(edu)": "97K50",
      "keywords": "sigma-field sigma-algebra, Borel set",
      "directory": "/probability/basic",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 157,
      "mml-name": "prob_2",
      "title": "Probability",
      "summary": "Some further theorems concerning probability, among them the equivalent definition of probability are discussed, followed by notions of independence of events and conditional probability and basic theorems on them.",
      "msc2020": "60A10 & 28A05",
      "msc2020(edu)": "97K50",
      "keywords": "probability, conditional probability",
      "directory": "/probability/basic",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 158,
      "mml-name": "limfunc1",
      "title": "The Limit of a Real Function at Infinity",
      "summary": "  We introduced the halflines ({\\it open} and {\\it closed}),   real sequences divergent to infinity ({\\it plus} and {\\it minus}) and   the proper and improper limit of a real function at infinty.   We prove basic properties of halflines, sequences divergent   to infinity and the limit of function at infinity.",
      "msc2020": "26A03",
      "msc2020(edu)": "97I20",
      "keywords": "real function, infinity, limit, half line, sequence divergent",
      "directory": "/analysis/limit/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 159,
      "mml-name": "limfunc2",
      "title": "The One-Side Limits of a Real Function at a Point",
      "summary": " We introduce the left-side and the right-side limit of a real function at a point. We prove a few properties of the operations  on the proper and improper one-side limits and show that Cauchy and Heine characterizations of the one-side limit are equivalent.",
      "msc2020": "26A03",
      "msc2020(edu)": "97I20",
      "keywords": "real function, one-side limit, Cauchy and Heine characterizations",
      "directory": "/analysis/limit/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 160,
      "mml-name": "seqfunc",
      "title": "Functional Sequence from a Domain to a Domain",
      "summary": "Definitions of functional sequences and basic operations on functional sequences from a domain to a domain, point and uniform convergence, limit of functional sequence from a domain to the set of real numbers and facts about properties of the limit of functional sequences are proved.",
      "msc2020": "40A30",
      "msc2020(edu)": "97I20 & 97I30",
      "keywords": "real funciton, functional sequences, point convergence, uniform convergence, limit",
      "directory": "/analysis/sequence/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 161,
      "mml-name": "limfunc3",
      "title": "The Limit of a Real Function at a Point",
      "summary": " We define the proper and the improper limit of a real function at a point.  The main properties of the operations on the limit of function are proved. The connection between the one-side limits and the limit of function at a point are exposed.  Equivalent Cauchy and Heine characterizations of the limit of real function at a point are proved.",
      "msc2020": "26A03",
      "msc2020(edu)": "97I20",
      "keywords": "real function, proper limit, improper limit",
      "directory": "/analysis/limit/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 162,
      "mml-name": "fcont_3",
      "title": "Monotonic and Continuous Real Function",
      "summary": " A continuation of \\cite{FCONT_1.ABS} and \\cite{FCONT_2.ABS}.  We prove a few theorems about real functions monotonic and continuous on interval, on halfline and on the set of real numbers and continuity of the inverse function.  At the beginning of the paper we show some facts about topological properties of the set of real numbers, halflines and intervals which rather belong to \\cite{RCOMP_1.ABS}.",
      "msc2020": "26A15 & 26A48",
      "msc2020(edu)": "97I20",
      "keywords": "monotonic function, continuous function, real function",
      "directory": "/analysis/continuity/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 163,
      "mml-name": "limfunc4",
      "title": "The Limit of a Composition of Real Functions",
      "summary": " The theorem on the proper and improper limit of a composition of real functions at a point, at infinity and  one-side limits at a point are presented.",
      "msc2020": "26A03",
      "msc2020(edu)": "97I20",
      "keywords": "real function, composition, limit, proper limit, improper limit, one-side limit",
      "directory": "/analysis/limit/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 164,
      "mml-name": "l_hospit",
      "title": "The de l'{H}ospital Theorem",
      "summary": "List of theorems concerning  the de l'Hospital Theorem. We discuss the case when both  functions have the zero value at a point and when  the quotient of their differentials is convergent at  this point.",
      "msc2020": "26A24",
      "msc2020(edu)": "97I40",
      "keywords": "real function, differentiable, L'Hôpital's theorem",
      "directory": "/analysis/differential/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 165,
      "mml-name": "fdiff_2",
      "title": "Real Function Differentiability --- Part {II}",
      "summary": "  A continuation of \\cite{FDIFF_1.ABS}. We prove equivalent definition of the derivative of the real function at the point and theorems about derivative of composite functions, inverse function and derivative of quotient of two functions.  At the beginning of the paper a few facts which rather belong to  \\cite{SEQ_2.ABS}, \\cite{SEQM_3.ABS} and \\cite{SEQ_4.ABS} are proved.",
      "msc2020": "26A24",
      "msc2020(edu)": "97I40",
      "keywords": "real function, derivative, composition, inverse, quotient",
      "directory": "/analysis/differential/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 166,
      "mml-name": "fdiff_3",
      "title": "Real Function One-Side Differentiability",
      "summary": "We define real function one-side differentiability and one-side continuity. Main properties of one-side differentiability function are proved. Connections between one-side differential and differential real function at the point are demonstrated.",
      "msc2020": "26A24",
      "msc2020(edu)": "97I40",
      "keywords": "one-side differentiability, one-side continuity",
      "directory": "/analysis/differential/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 167,
      "mml-name": "measure1",
      "title": "The $\\sigma$-additive Measure Theory",
      "summary": "   The article contains definition and basic properties of $\\sigma$-additive, nonnegative measure, with values in  $\\overline{\\Bbb R}$, the enlarged set of real numbers, where $\\overline{\\Bbb R}$ denotes set $\\overline{\\Bbb R} = {\\Bbb R} \\cup \\{-\\infty,+\\infty\\}$ -  by \\cite{SIKORSKI:1}.   We present definitions of $\\sigma$-field of sets, $\\sigma$-additive measure, measurable sets, measure zero sets and the basic theorems describing relationships between the notion mentioned above. The work is the third part of the series of articles concerning the Lebesgue measure theory.",
      "msc2020": "28A05 & 28A60",
      "msc2020(edu)": "97I50",
      "keywords": "sigma-algebra, sigma-additive, non-negative measure",
      "directory": "/analysis/measure",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 168,
      "mml-name": "measure2",
      "title": "Several Properties of the $\\sigma$-additive Measure",
      "summary": " A continuation of \\cite{MEASURE1.ABS}.    The paper contains the definition and basic properties of a   $\\sigma$-additive, nonnegative measure, with values in $\\overline{\\Bbb R}$, the enlarged set of  real numbers, where $\\overline{\\Bbb R}$ denotes set $\\overline{\\Bbb R} = {\\Bbb R}   \\cup \\{-\\infty,+\\infty\\}$ --- by R.~Sikorski \\cite{SIKORSKI:1}. Some simple theorems concerning basic  properties of a $\\sigma$-additive measure, measurable sets, measure zero sets are proved. The work is the fourth part of the series of articles concerning the Lebesgue measure theory.",
      "msc2020": "28A05 & 28A60",
      "msc2020(edu)": "97I50",
      "keywords": "sigma-algebra, sigma-additive, non-negative measure, measurable sets, measure zero sets",
      "directory": "/analysis/measure",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 169,
      "mml-name": "measure3",
      "title": "Completeness of the $\\sigma$-Additive Measure. {M}easure Theory",
      "summary": "Definitions and basic properties of a $\\sigma$-additive, non-negative measure, with values in $\\overline{\\Bbb R}$,  the enlarged set of real numbers, where $\\overline{\\Bbb R}$ denotes set $\\overline{\\Bbb R} =  {\\Bbb R}\\cup\\{-\\infty,+\\infty\\}$ - by \\cite{SIKORSKI:1}. The article includes the text being a continuation of the paper   \\cite{MEASURE2.ABS}. Some theorems concerning basic properties of a $\\sigma$-additive measure and completeness of the measure are proved.",
      "msc2020": "28A05 & 28A60",
      "msc2020(edu)": "97I50",
      "keywords": "sigma-algebra, sigma-additive, non-negative measure, measurable sets, completeness",
      "directory": "/analysis/measure",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 170,
      "mml-name": "measure4",
      "title": "Properties of {C}aratheodor's Measure",
      "summary": "   The paper contains definitions and basic properties of Ca\\-ra\\-the\\-o\\-dor's measure, with values in $\\overline{\\Bbb R}$, the enlarged set of real numbers, where $\\overline{\\Bbb R}$ denotes set $\\overline{\\Bbb R} =  {\\Bbb R}\\cup\\{-\\infty,+\\infty\\}$ - by \\cite{SIKORSKI:1}.    The article includes the text being a continuation of the paper    \\cite{MEASURE3.ABS}. Caratheodor's theorem and some theorems concerning basic properties of Caratheodor's measure are proved. The work is the sixth part of the series of articles concerning the Lebesgue measure theory.",
      "msc2020": "28A05 & 28A60",
      "msc2020(edu)": "97I50",
      "keywords": "sigma-algebra, Caratheodory's measure",
      "directory": "/analysis/measure",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 171,
      "mml-name": "rfunct_3",
      "title": "Properties of Partial Functions from a Domain to the Set of Real Numbers",
      "summary": "The article consists of two parts. In the first one     we consider notion of nonnegative and nonpositive part of a real numbers.      In the second we consider partial function from a domain to the set of     real numbers (or more general to a domain). We define a few new operations     for these functions and show connections between finite sequences of real     numbers and functions which domain is finite. We introduce      {\\em integrations} for finite domain real valued functions.",
      "msc2020": "26A03 & 03E20",
      "msc2020(edu)": "97I20",
      "keywords": "number, function, finite domain, operation, real-valued",
      "directory": "/analysis/basic/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 172,
      "mml-name": "measure5",
      "title": "Properties of the Intervals of Real Numbers",
      "summary": "The paper contains definitions and basic properties   of the intervals of real numbers.\\par    The article includes the text being a continuation of   the  paper \\cite{MEASURE4.ABS}.   Some theorems concerning basic properties of intervals   are proved.",
      "msc2020": "28A05 & 28A10 & 28A60",
      "msc2020(edu)": "97F50 & 97I50",
      "keywords": "sigma-algebra, real, interval",
      "directory": "/analysis/measure/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 173,
      "mml-name": "rearran1",
      "title": "Introduction to Theory of Rearrangement",
      "summary": "An introduction to the rearrangement theory for finite functions (e.g. with the finite domain and codomain). The notion of generators and cogenerators of finite sets (equivalent to the order in the language of finite sequences) has been defined. The notion of rearrangement for a function into finite set is presented. Some basic properties of these notions have been proved.",
      "msc2020": "40-00",
      "msc2020(edu)": "97I30",
      "keywords": "rearrangement, finite domain, finite codomain, real",
      "directory": "/sequence/finite",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 174,
      "mml-name": "measure6",
      "title": "Some Properties of the Intervals",
      "msc2020": "28A05 & 28A10 & 28A60",
      "msc2020(edu)": "97F50 & 97I50",
      "keywords": "real, interval, open, closed, inverse",
      "directory": "/analysis/measure/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 175,
      "mml-name": "extreal1",
      "title": "Basic Properties of Extended Real Numbers",
      "summary": "We introduce product, quotient and absolute value,        and we prove some basic properties of extended real numbers.",
      "msc2020": "28A05 & 28A10 & 28A60",
      "msc2020(edu)": "97F50 & 97I50",
      "keywords": "extended real number",
      "directory": "/analysis/measure/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 176,
      "mml-name": "measure7",
      "title": "The One-Dimensional {L}ebesgue Measure ",
      "summary": "The paper is the crowning  of a series of articles  written in  the  Mizar  language, being a formalization of  notions needed  for the description of the one-dimensional  Lebesgue measure. The formalization of the notion as classical  as the Lebesgue measure determines the powers of the  PC Mizar system as a tool for the strict, precise notation  and verification of the correctness of deductive theories.  Following the successive articles \\cite{SUPINF_1.ABS},  \\cite{SUPINF_2.ABS}, \\cite{MEASURE1.ABS}, \\cite{MEASURE6.ABS}  constructed so that the final one should  include the definition and the basic properties of the Lebesgue   measure, we observe  one  of  the paths relatively  simple in the sense of the definition, enabling  us the  formal  introduction  of  this  notion. This way, although  toilsome, since  such is the nature of formal theories, is  greatly instructive. It brings home  the proper succession  of the introduction of the definitions of intermediate notions  and points out to those elements of the theory which  determine  the  essence  of  the  complexity of the notion  being introduced.\\par     The paper includes the definition of the $\\sigma$-field of  Lebesgue  measurable sets, the definition  of the Lebesgue  measure and the basic set  of  the theorems describing its  properties.",
      "msc2020": "26A42 & 28A05 & 28A10 & 28A60",
      "msc2020(edu)": "97I50",
      "keywords": "Lebesgue measure, sigma field",
      "directory": "/analysis/measure",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 177,
      "mml-name": "rfunct_4",
      "title": "Introduction to Several Concepts of Convexity and Semicontinuity for Function from ${\\Bbb R}$ to ${\\Bbb R}$",
      "summary": "This article is an introduction to convex analysis. In the beginning, we have defined the concept of strictly convexity and proved some basic properties between convexity and strictly convexity. Moreover, we have defined concepts of other convexity and semicontinuity, and proved their basic properties.",
      "msc2020": "26A15 & 26A51",
      "msc2020(edu)": "97I20",
      "keywords": "real function, convixity, strictly convexity, semicontinouity",
      "directory": "/analysis/basic/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 178,
      "mml-name": "mesfunc1",
      "title": "Definitions and Basic Properties of Measurable Functions",
      "summary": "In this article we introduce some definitions concerning measurable functions and prove related properties.",
      "msc2020": "28A20",
      "msc2020(edu)": "97I50",
      "keywords": "measure, measureable function",
      "directory": "/analysis/measure/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 179,
      "mml-name": "sin_cos",
      "title": "Trigonometric Functions and Existence of Circle Ratio",
      "summary": "In this article, we defined {\\em sinus} and {\\em cosine} as the real part  and the imaginary part of the exponential function on complex, and also give their series expression. Then we proved the differentiablity of {\\em sinus}, {\\em cosine}  and the exponential function of real. Finally, we showed the existence of the circle ratio, and some formulas  of {\\em sinus}, {\\em cosine}.",
      "msc2020": "33B10",
      "msc2020(edu)": "97G60",
      "keywords": "sin, cos, trigonometric function, exponential function, series expression, differential, circle ratio",
      "directory": "/analysis/trigonometric",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 180,
      "mml-name": "mesfunc2",
      "title": "The Measurability of Extended Real Valued Functions",
      "summary": "In this article we prove the measurablility of some extended real valued functions which are $f$+$g$, $f$\\,--\\,$g$ and so on. Moreover, we will define the simple function which are defined on the sigma field. It will play an important role for the Lebesgue integral theory.",
      "msc2020": "28A20",
      "msc2020(edu)": "97I50",
      "keywords": "measure, measureable function, sigma field",
      "directory": "/analysis/measure/real",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 181,
      "mml-name": "sin_cos2",
      "title": "Properties of the Trigonometric Function",
      "summary": "This article introduces the monotone increasing and the monotone decreasing of  {\\em sinus} and {\\em cosine}, and definitions of hyperbolic {\\em sinus}, hyperbolic   {\\em cosine} and hyperbolic {\\em tangent}, and some related formulas about them.",
      "msc2020": "33B10",
      "msc2020(edu)": "97G60",
      "keywords": "sin, cos, trigonometric function, monotonic, hyperbolic sin, hyperbolic tan",
      "directory": "/analysis/trigonometric",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 182,
      "mml-name": "sin_cos3",
      "title": "Trigonometric Functions on Complex Space",
      "summary": "This article describes definitions of sine, cosine,    hyperbolic sine and   hyperbolic cosine. Some of their basic properties are discussed.",
      "msc2020": "33B10",
      "msc2020(edu)": "97G60",
      "keywords": "sin, cos, trigonometric function, monotonic, hyperbolic sin, hyperbolic tan",
      "directory": "/analysis/trigonometric",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 183,
      "mml-name": "sin_cos4",
      "title": "Formulas and Identities of Trigonometric Functions",
      "summary": "In this article, we concentrated especially on   addition formulas of fundamental trigonometric functions,   and their identities.",
      "msc2020": "33B10",
      "msc2020(edu)": "97G60",
      "keywords": "sin, cos, trigonometirc function, addition formulas",
      "directory": "/analysis/trigonometric",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 184,
      "mml-name": "sin_cos5",
      "title": "Formulas and Identities of Trigonometric Functions",
      "msc2020": "33B10",
      "msc2020(edu)": "97G60",
      "keywords": "sin, cos, trigonometirc function, double-angle formulas",
      "directory": "/analysis/trigonometric",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 185,
      "mml-name": "asympt_0",
      "title": "Asymptotic Notation. {P}art {I}: {T}heory",
      "summary": "The widely used textbook by Brassard and Bratley \\cite{BraBra96} includes a chapter devoted to asymptotic notation (Chapter 3, pp. 79--97). We have attempted to test how suitable the current version of Mizar is for recording this type of material in its entirety.  A more detailed report on this experiment will be available separately. This article presents the development of notions and a follow-up article \\cite{ASYMPT_1.ABS} includes examples and solutions to problems. The preliminaries introduce a number of properties of real sequences, some operations on real sequences, and a characterization of convergence.  The remaining sections in this article correspond to sections of Chapter 3 of \\cite{BraBra96}.  Section 2 defines the $O$ notation and proves the threshold, maximum, and limit rules.  Section 3 introduces the $\\Omega$ and $\\Theta$ notations and their analogous rules. Conditional asymptotic notation is defined in Section 4 where smooth functions are also discussed.  Section 5 defines some operations on asymptotic notation (we have decided not to introduce the asymptotic notation for functions of several variables as it is a straightforward generalization of notions for unary functions).",
      "msc2020": "26A12 & 40A05",
      "msc2020(edu)": "97I20 & 97I30",
      "keywords": "real function, real sequence, asymptotic notation, convergence, threshold, maximum, limit rules",
      "directory": "/analysis/orders_of_infinity",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 186,
      "mml-name": "comptrig",
      "title": "Trigonometric Form of Complex Numbers",
      "msc2020": "33B10",
      "msc2020(edu)": "97F50 & 97G60 & 97I80",
      "keywords": "trigotometric form, complex, argument ",
      "directory": "/analysis/trigonometric/complex",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 187,
      "mml-name": "complex2",
      "title": "Inner Products and Angles of Complex Numbers",
      "summary": "An inner product of complex numbers is defined and used to  characterize the (counter-clockwise) angle between ($a$,0) and (0,$b$)  in the complex plane.  For complex $a$, $b$ and $c$ we then define the  (counter-clockwise) angle between ($a$,$c$) and ($c$, $b$) and prove  theorems about the sum of internal and external angles of a triangle.",
      "msc2020": "33B10",
      "msc2020(edu)": "97F50 & 97G60 & 97I80",
      "keywords": "trigotometric form, complex, product, angle",
      "directory": "/analysis/trigonometric/complex",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 188,
      "mml-name": "polyeq_2",
      "title": "Solving Roots of Polynomial Equation  of Degree 4 with Real Coefficients",
      "summary": "In this paper, we describe the definition of the  fourth degree algebraic equations and their properties. We clarify the relation between the four roots of this equation and its coefficient. Also, the form of these roots for various conditions is discussed. This solution is known as the Cardano solution.",
      "msc2020": "12D10",
      "msc2020(edu)": "97H30",
      "keywords": "polynomial, algebraic equation, fourth degree equation, solving roots, Cardano solution, real coefficient",
      "directory": "/algebra/equation",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 189,
      "mml-name": "polyeq_3",
      "title": "Solving Roots of Polynomial Equation  of Degree 2 and 3 with Complex Coefficients",
      "summary": "In the article, solving complex roots of polynomial   equation of degree 2 and 3 with real coefficients and   complex roots of polynomial equation of degree 2 and 3   with complex coefficients is discussed.",
      "msc2020": "12D10",
      "msc2020(edu)": "97H30",
      "keywords": "polynomial, algebraic equation, discriminant, quadratic equation, cubic equation, solving roots, Cardano solution, complex coefficient",
      "directory": "/algebra/equation",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 190,
      "mml-name": "polyeq_4",
      "title": "Solving Roots of the Special Polynomial Equation with Real Coefficients",
      "msc2020": "12D10",
      "msc2020(edu)": "97H30",
      "keywords": "polynomial, algebraic equation, fifth degree equation, solving roots",
      "directory": "/algebra/equation",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 191,
      "mml-name": "polyeq_5",
      "title": "Solution of Cubic and Quartic Equations",
      "summary": "In this article, the principal $n$-th root of    a complex number is defined, the Vieta's formulas for    polynomial equations of degree 2, 3 and 4 are formalized.    The solution of quadratic equations, the Cardan's solution    of cubic equations and the Descartes-Euler solution of    quartic equations in terms of their complex coefficients    are also presented \\cite{Korn}.",
      "msc2020": "12D10",
      "msc2020(edu)": "97H30",
      "keywords": "polynomial, algebraic equation, quadratic  equation, cubic equation, fourth degree equation, solving roots, Vieta's formulas, Cardan's solution, Descartes-Euler solution",
      "directory": "/algebra/equation",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 192,
      "mml-name": "sin_cos6",
      "title": "Inverse Trigonometric Functions Arcsin and Arccos",
      "summary": "Notions of inverse sine and inverse cosine have been introduced.          Their basic properties have been proved.",
      "msc2020": "33B10",
      "msc2020(edu)": "97G60",
      "keywords": "sin, cos, trigonometirc function, inverse, arcsin, arccos ",
      "directory": "/analysis/trigonometric",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 193,
      "mml-name": "euler_1",
      "title": "The {E}uler's Function",
      "summary": "This article is concerned with the Euler's function \\cite{takagi} that plays an  important role in cryptograms. In the first section, we present some selected theorems on integers. Next, we define the Euler's function. Finally, three theorems relating to the  Euler's function are proved. The third theorem concerns two relatively prime integers which make up the Euler's function parameter. In the public key  cryptography these two integer values are used as public and secret keys.",
      "msc2020": "11A25 & 11A51",
      "msc2020(edu)": "97F40",
      "keywords": "Euler's function, primarity",
      "directory": "/algebra/integer",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 194,
      "mml-name": "euler_2",
      "title": "{E}uler's {T}heorem and Small {F}ermat's {T}heorem",
      "summary": "This article is concerned with Euler's theorem and small    Fermat's theorem that play important roles in public-key   cryptograms. In the first section, we present some selected   theorems on integers. In the following section, we remake   definitions about the finite sequence of natural, the function   of natural times finite sequence of natural and $\\pi$ of the finite   sequence of natural. We also prove some basic theorems that   concern these redefinitions. Next, we define the   function of modulus for finite sequence of natural and some   fundamental theorems about this function are proved. Finally,   Euler's theorem and small Fermat's theorem are proved.",
      "msc2020": "11A41 & 11A51",
      "msc2020(edu)": "97F40",
      "keywords": "Euler's theorem,  small Fermat's theorem, primarity",
      "directory": "/algebra/integer",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 195,
      "mml-name": "asympt_1",
      "title": "Asymptotic Notation. {P}art {II}: {E}xamples and Problems",
      "summary": "The widely used textbook by Brassard and Bratley \\cite{BraBra96} includes a chapter devoted to asymptotic notation (Chapter 3, pp. 79--97). We have attempted to test how suitable the current version of Mizar is for recording this type of material in its entirety. This article is a follow-up to \\cite{ASYMPT_0.ABS} in which we introduced the basic notions and general theory. This article presents a Mizar formalization of examples and solutions to problems from Chapter 3 of \\cite{BraBra96} (some of the examples and solved problems are also in \\cite{ASYMPT_0.ABS}). Not all problems have been solved as some required solutions not amenable for formalization.",
      "msc2020": "26A12 & 40A05",
      "msc2020(edu)": "97I20 & 97I30",
      "keywords": "real function, real sequence, asymptotic notation, convergence, threshold, maximum, limit rules",
      "directory": "/analysis/orders_of_infinity",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 196,
      "mml-name": "series_3",
      "title": "On the Partial Product of Series and Related Basic Inequalities",
      "summary": "This article describes definition of partial product of series,           introduced similarly to its related partial sum,           as well as several important inequalities true for           chosen special series.",
      "msc2020": "40A99",
      "msc2020(edu)": "97I30",
      "keywords": "series, partial product, partial sum, inequality, real series",
      "directory": "/sequence/sum",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 197,
      "mml-name": "series_4",
      "title": "Partial Sum and Partial Product of Some Series",
      "summary": "This article contains partial sum and partial product       of some series which are often used.",
      "msc2020": "40A99",
      "msc2020(edu)": "97I30",
      "keywords": "series, partial product, partial sum, inequality, real series",
      "directory": "/sequence/sum",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 198,
      "mml-name": "series_5",
      "title": "On the Partial Product and Partial Sum of     Series and Related Basic Inequalities",
      "summary": "This article introduced some important inequalities            on partial sum and partial            product, as well as some basic inequalities.",
      "msc2020": "40A99",
      "msc2020(edu)": "97I30",
      "keywords": "series, partial product, partial sum, inequality, real series",
      "directory": "/sequence/sum",
      "期限": "2021-10-28T15:00:00.000Z"
    },
    {
      "mml-order": 199,
      "mml-name": "quaterni",
      "title": "The Quaternion Numbers",
      "summary": "In this article, we define the set $\\Bbb H$ of     quaternion numbers as the set of all ordered sequences     $q =\\langle x,y,w,z\\rangle$ where $x$,$y$,$w$ and $z$ are real numbers.    The addition, difference and multiplication of the quaternion numbers     are also defined.    We define the real and imaginary parts of $q$ and denote this     by $x = \\Re(q)$, $y = \\Im_1(q)$, $w = \\Im_2(q)$, $z = \\Im_3(q)$.    We define the addition, difference, multiplication again and denote     this operation by real and three imaginary parts. We define the     conjugate of $q$ denoted by $q*'$ and the absolute value of $q$     denoted by $|q|$. We also give some properties of quaternion numbers.",
      "msc2020": "11R52",
      "msc2020(edu)": "97F20",
      "keywords": "quaternion number, addition, difference, multiplication",
      "directory": "/number/quaternion",
      "期限": "2021-10-28T15:00:00.000Z"
    }
]
}